{"id":"10.1103/RevModPhys.89.035004","title":{"value":"Electron vortices: Beams with orbital angular momentum","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"RMP","abbreviatedName":"Rev. Mod. Phys.","name":"Reviews of Modern Physics"},"issue":{"number":"3"},"volume":{"number":"89"},"pageStart":"035004","hasArticleId":true,"date":"2017-08-16","numPages":44,"articleType":"article","identifiers":{"doi":"10.1103/RevModPhys.89.035004"},"rights":{"rightsStatement":"© 2017 American Physical Society","copyrightYear":2017,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"S. M. Lloyd","firstname":"S. M.","surname":"Lloyd","affiliationIds":["a1"]},{"type":"Person","name":"M. Babiker","firstname":"M.","surname":"Babiker","affiliationIds":["a1"]},{"type":"Person","name":"G. Thirunavukkarasu","firstname":"G.","surname":"Thirunavukkarasu","affiliationIds":["a1"]},{"type":"Person","name":"J. Yuan","firstname":"J.","surname":"Yuan","affiliationIds":["a1"]}],"affiliations":[{"id":"a1","name":"Department of Physics, University of York, Heslington, York, YO10 5DD, United Kingdom"}],"abstract":{"value":"<p>The recent prediction and subsequent creation of electron vortex beams in a number of laboratories occurred after almost 20 years had elapsed since the recognition of the physical significance and potential for applications of the orbital angular momentum carried by optical vortex beams. A rapid growth in interest in electron vortex beams followed, with swift theoretical and experimental developments. Much of the rapid progress can be attributed in part to the clear similarities between electron optics and photonics arising from the functional equivalence between the Helmholtz equations governing the free-space propagation of optical beams and the time-independent Schrödinger equation governing freely propagating electron vortex beams. There are, however, key differences in the properties of the two kinds of vortex beams. This review is primarily concerned with the electron type, with specific emphasis on the distinguishing vortex features: notably the spin, electric charge, current and magnetic moment, the spatial distribution, and  the associated electric and magnetic fields. The physical consequences and potential applications of such properties are pointed out and analyzed, including nanoparticle manipulation and the mechanisms of orbital angular momentum transfer in the electron vortex interaction with matter.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"8ab3d2b7-b50b-460e-b086-8990cfcbd350","label":"Atomic, Molecular & Optical"}],"concepts":[{"id":"a9c20b4d-69a1-40f1-81c1-86b01859b80c","label":"Beam optics","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true}]}}}