{"id":"10.1103/RevModPhys.89.015003","title":{"value":"Electron-phonon interactions from first principles","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"RMP","abbreviatedName":"Rev. Mod. Phys.","name":"Reviews of Modern Physics"},"issue":{"number":"1"},"volume":{"number":"89"},"pageStart":"015003","hasArticleId":true,"date":"2017-02-16","numPages":63,"articleType":"article","identifiers":{"doi":"10.1103/RevModPhys.89.015003"},"rights":{"rightsStatement":"© 2017 American Physical Society","copyrightYear":2017,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"Feliciano Giustino","firstname":"Feliciano","surname":"Giustino","affiliationIds":["a1"]}],"affiliations":[{"id":"a1","name":"Department of Materials, University of Oxford, Parks Road, Oxford OX1 3PH, United Kingdom"}],"abstract":{"value":"<p>This article reviews the theory of electron-phonon interactions in solids from the point of view of <i>ab initio</i> calculations. While the electron-phonon interaction has been studied for almost a century, predictive nonempirical calculations have become feasible only during the past two decades. Today it is possible to calculate from first principles many materials properties related to the electron-phonon interaction, including the critical temperature of conventional superconductors, the carrier mobility in semiconductors, the temperature dependence of optical spectra in direct and indirect-gap semiconductors, the relaxation rates of photoexcited carriers, the electron mass renormalization in angle-resolved photoelectron spectra, and the nonadiabatic corrections to phonon dispersion relations. In this article a review of the theoretical and computational framework underlying modern electron-phonon calculations from first principles as well as landmark investigations of the electron-phonon interaction in real materials is given. The first part of the article summarizes the elementary theory of electron-phonon interactions and their calculations based on density-functional theory. The second part discusses a general field-theoretic formulation of the electron-phonon problem and establishes the connection with practical first-principles calculations. The third part reviews a number of recent investigations of electron-phonon interactions in the areas of vibrational spectroscopy, photoelectron spectroscopy, optical spectroscopy, transport, and superconductivity.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"a48f173e-6459-4642-a711-a6e731807625","label":"Condensed Matter & Materials Physics"}],"concepts":[{"id":"2cb8570abc2f41aba3f11467b288c3f0","label":"Electron-phonon coupling","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true},{"id":"55bba34b0d31428fa4304f502667434a","label":"First-principles calculations","facet":{"id":"233a6cd0-b7fe-491b-b5fd-85fd6b2a7c79","label":"Theoretical & Computational Techniques"}}]}}}