{"id":"10.1103/RevModPhys.89.025008","title":{"value":"Perpendicular magnetic anisotropy at transition metal/oxide interfaces and applications","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"RMP","abbreviatedName":"Rev. Mod. Phys.","name":"Reviews of Modern Physics"},"issue":{"number":"2"},"volume":{"number":"89"},"pageStart":"025008","hasArticleId":true,"date":"2017-06-28","numPages":54,"articleType":"article","identifiers":{"doi":"10.1103/RevModPhys.89.025008"},"rights":{"rightsStatement":"© 2017 American Physical Society","copyrightYear":2017,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"B. Dieny","firstname":"B.","surname":"Dieny","affiliationIds":["a1"]},{"type":"Person","name":"M. Chshiev","firstname":"M.","surname":"Chshiev","affiliationIds":["a1"]}],"affiliations":[{"id":"a1","name":"Univ. Grenoble Alpes, INAC-SPINTEC, F-38000 Grenoble, France, CEA, INAC-SPINTEC, F-38000 Grenoble, France, and CNRS, SPINTEC, F-38000 Grenoble, France"}],"abstract":{"value":"<p>Spin electronics is a rapidly expanding field stimulated by a strong synergy between breakthrough basic research discoveries and industrial applications in the fields of magnetic recording, magnetic field sensors, nonvolatile memories [magnetic random access memories (MRAM) and especially spin-transfer-torque MRAM (STT-MRAM)]. In addition to the discovery of several physical phenomena (giant magnetoresistance, tunnel magnetoresistance, spin-transfer torque, spin-orbit torque, spin Hall effect, spin Seebeck effect, etc.), outstanding progress has been made on the growth and nanopatterning of magnetic multilayered films and nanostructures in which these phenomena are observed. Magnetic anisotropy is usually observed in materials that have large spin-orbit interactions. However, in 2002 perpendicular magnetic anisotropy (PMA) was discovered to exist at magnetic metal/oxide interfaces [for instance <span class=\"aps-inline-formula\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\" display=\"inline\"><mrow><mi>Co</mi><mo stretchy=\"false\">(</mo><mi>Fe</mi><mo stretchy=\"false\">)</mo><mo>/</mo><mtext>alumina</mtext></mrow></math></span>]. Surprisingly, this PMA is observed in systems where spin-orbit interactions are quite weak, but its amplitude is remarkably large—comparable to that measured at <span class=\"aps-inline-formula\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\" display=\"inline\"><mrow><mrow><mi>Co</mi><mo>/</mo><mi>Pt</mi></mrow></mrow></math></span> interfaces, a reference for large interfacial anisotropy (<span class=\"aps-inline-formula\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\" display=\"inline\"><mrow><mtext>anisotropy</mtext><mspace linebreak=\"goodbreak\"></mspace><mo>∼</mo><mn>1.4</mn><mtext> </mtext><mtext> </mtext><mi>erg</mi><mo>/</mo><msup><mrow><mi>cm</mi></mrow><mrow><mn>2</mn></mrow></msup><mo>=</mo><mn>1.4</mn><mtext> </mtext><mtext> </mtext><mi>mJ</mi><mo>/</mo><msup><mrow><mi mathvariant=\"normal\">m</mi></mrow><mrow><mn>2</mn></mrow></msup></mrow></math></span>). Actually, this PMA was found to be very common at magnetic metal/oxide interfaces since it has been observed with a large variety of amorphous or crystalline oxides, including AlOx, MgO, TaOx, HfOx, etc. This PMA is thought to be the result of electronic hybridization between the oxygen and the magnetic transition metal orbit across the interface, a hypothesis supported by <i>ab initio</i> calculations. Interest in this phenomenon was sparked in 2010 when it was demonstrated that the PMA at magnetic transition metal/oxide interfaces could be used to build out-of-plane magnetized magnetic tunnel junctions for STT-MRAM cells. In these systems, the PMA at the <span class=\"aps-inline-formula\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\" display=\"inline\"><mrow><mi>CoFeB</mi><mo>/</mo><mi>MgO</mi></mrow></math></span> interface can be used to simultaneously obtain good memory retention, thanks to the large PMA amplitude, and a low write current, thanks to a relatively weak Gilbert damping. These two requirements for memories tend to be difficult to reconcile since they rely on the same spin-orbit coupling. PMA-based approaches have now become ubiquitous in the designs for perpendicular STT-MRAM, and major microelectronics companies are actively working on their development with the first goal of addressing embedded FLASH and static random access memory-type of applications. Scalability of STT-MRAM devices based on this interfacial PMA is expected to soon exceed the 20-nm nodes. Several very active new fields of research also rely on interfacial PMA at magnetic metal/oxide interfaces, including spin-orbit torques associated with Rashba or spin Hall effects, record high speed domain wall propagation in buffer/magnetic metal/oxide-based magnetic wires, and voltage-based control of anisotropy. This review deals with PMA at magnetic metal/oxide interfaces from its discovery, by examining the diversity of systems in which it has been observed and the physicochemical methods through which the key roles played by the electronic hybridization at the metal/oxide interface were elucidated. The physical origins of the phenomenon are also covered and how these are supported by <i>ab initio</i> calculations is dealt with. Finally, some examples of applications of this interfacial PMA in STT-MRAM are listed along with the various emerging research topics taking advantage of this PMA.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"a48f173e-6459-4642-a711-a6e731807625","label":"Condensed Matter & Materials Physics"}],"concepts":[{"id":"dd3e5997182148c18e5dd122961272cf","label":"Magnetic anisotropy","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true}]}}}