{"id":"10.1103/RevModPhys.89.015006","title":{"value":"Stimulated Raman adiabatic passage in physics, chemistry, and beyond","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"RMP","abbreviatedName":"Rev. Mod. Phys.","name":"Reviews of Modern Physics"},"issue":{"number":"1"},"volume":{"number":"89"},"pageStart":"015006","hasArticleId":true,"date":"2017-03-08","numPages":66,"articleType":"article","identifiers":{"doi":"10.1103/RevModPhys.89.015006"},"rights":{"rightsStatement":"© 2017 American Physical Society","copyrightYear":2017,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"Nikolay V. Vitanov","firstname":"Nikolay V.","surname":"Vitanov","affiliationIds":["a1"]},{"type":"Person","name":"Andon A. Rangelov","firstname":"Andon A.","surname":"Rangelov","affiliationIds":["a2"]},{"type":"Person","name":"Bruce W. Shore","firstname":"Bruce W.","surname":"Shore","affiliationIds":["a3"]},{"type":"Person","name":"Klaas Bergmann","firstname":"Klaas","surname":"Bergmann","affiliationIds":["a4"]}],"affiliations":[{"id":"a1","name":"Faculty of Physics, St Kliment Ohridski University of Sofia, James Bourchier 5 blvd, 1164 Sofia, Bulgaria"},{"id":"a2","name":"Faculty of Physics, St Kliment Ohridski University of Sofia, James Bourchier 5 blvd, 1164 Sofia, Bulgaria"},{"id":"a3","name":"618 Escondido Circle, Livermore, California 94550, USA"},{"id":"a4","name":"Fachbereich Physik und Forschungszentrum OPTIMAS, Technische Universität Kaiserslautern, Germany"}],"abstract":{"value":"<p>The technique of stimulated Raman adiabatic passage (STIRAP), which allows efficient and selective population transfer between quantum states without suffering loss due to spontaneous emission, was introduced in 1990 by Gaubatz <i>et al.</i>. Since then STIRAP has emerged as an enabling methodology with widespread successful applications in many fields of physics, chemistry, and beyond. This article reviews the many applications of STIRAP emphasizing the developments since 2001, the time when the last major review on the topic was written (Vitanov, Fleischhauer <i>et al.</i>). A brief introduction into the theory of STIRAP and the early applications for population transfer within three-level systems is followed by the discussion of several extensions to multilevel systems, including multistate chains and tripod systems. The main emphasis is on the wide range of applications in atomic and molecular physics (including atom optics, cavity quantum electrodynamics, formation of ultracold molecules, etc.), quantum information (including single- and two-qubit gates, entangled-state preparation, etc.), solid-state physics (including processes in doped crystals, nitrogen-vacancy centers, superconducting circuits, semiconductor quantum dots and wells), and even some applications in classical physics (including waveguide optics, polarization optics, frequency conversion, etc.). Promising new prospects for STIRAP are also presented (including processes in optomechanics, precision experiments, detection of parity violation in molecules, spectroscopy of core-nonpenetrating Rydberg states, population transfer with x-ray pulses, etc.).</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"8ab3d2b7-b50b-460e-b086-8990cfcbd350","label":"Atomic, Molecular & Optical"}],"concepts":[{"id":"70cba0b1-a5ec-474b-a023-2ab4c3e484b9","label":"Effects of atomic coherence on light propagation","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}},{"id":"e4c4c0af-5486-4833-88ff-e347f070d04d","label":"Stimulated Raman adiabatic passage","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true}]}}}