{"id":"10.1103/RevModPhys.89.011003","title":{"value":"<i>Colloquium</i>: An algebraic model of localized surface plasmons and their interactions","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"RMP","abbreviatedName":"Rev. Mod. Phys.","name":"Reviews of Modern Physics"},"issue":{"number":"1"},"volume":{"number":"89"},"pageStart":"011003","hasArticleId":true,"date":"2017-01-30","numPages":20,"articleType":"article","identifiers":{"doi":"10.1103/RevModPhys.89.011003"},"rights":{"rightsStatement":"© 2017 American Physical Society","copyrightYear":2017,"copyrightHolders":[{"name":"au"},{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"T. J. Davis","firstname":"T. J.","surname":"Davis","affiliationIds":["a1"]},{"type":"Person","name":"D. E. Gómez","firstname":"D. E.","surname":"Gómez","affiliationIds":["a2"]}],"affiliations":[{"id":"a1","name":"School of Physics, University of Melbourne, Parkville Victoria Australia"},{"id":"a2","name":"Centre of Excellence for Exciton Science, RMIT University, Melbourne, 3000, Australia"}],"abstract":{"value":"<p>Although localized surface plasmons in metal nanoparticles can be modeled by Maxwells equations, the difficulty in solving them forces many researchers to use numerical methods. Such methods give accurate results but rarely provide much insight into the complex behaviors of the surface plasmons, nor do they provide a means to choose a configuration of metal nanoparticles to achieve a desired optical response. This Colloquium presents a simple algebraic approach for modeling localized surface plasmons, their excitation by light, and their interactions with one another. Although the method is not numerically accurate it yields useful insight into plasmon behavior and provides a basis for the design of complex plasmonic devices. The approach relies on a description of the surface plasmons in terms of a set of eigenmodes. However, the functional form of these modes is not usually required and the entire problem is reduced to a simple algebra involving the plasmon amplitudes, resonance terms, and their mutual coupling. The algebraic method is derived from an electrostatic formalism, appropriate for near-field interactions at optical frequencies, which is then used to demonstrate a variety of optical effects associated with localized surface plasmons, such as plasmon hybridization, induced transparency, Fano resonances, optical phase detection, and all-optical modulation, among others.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"8ab3d2b7-b50b-460e-b086-8990cfcbd350","label":"Atomic, Molecular & Optical"}],"concepts":[{"id":"df6f637ea45a4607a1b5e5f75827d500","label":"Surface plasmon polariton","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}},{"id":"37132a04c7844f13aaf4d75163a8b144","label":"Surface plasmons","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true}]}}}