{"id":"10.1103/RevModPhys.89.041001","title":{"value":"<i>Colloquium</i>: Strong optical forces on atoms in multifrequency light","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"RMP","abbreviatedName":"Rev. Mod. Phys.","name":"Reviews of Modern Physics"},"issue":{"number":"4"},"volume":{"number":"89"},"pageStart":"041001","hasArticleId":true,"date":"2017-10-19","numPages":18,"articleType":"article","identifiers":{"doi":"10.1103/RevModPhys.89.041001"},"rights":{"rightsStatement":"© 2017 American Physical Society","copyrightYear":2017,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"Harold Metcalf","firstname":"Harold","surname":"Metcalf","affiliationIds":["a1"]}],"affiliations":[{"id":"a1","name":"Physics and Astronomy, Stony Brook University, Stony Brook, New York 11794-3800, USA"}],"abstract":{"value":"<p>Optical forces on atoms irradiated with a single frequency of light have been extensively studied for many years, both theoretically and experimentally. The two-level atom model has been used to describe a wide range of optical force phenomena and to successfully exploit a large range of applications. New areas of study were opened up when the multiple levels of real atoms were considered. In contrast, using multifrequency light on a single atomic transition has not been studied as much, but using such light also results in very significant differences in the optical forces. This Colloquium outlines the basic concepts of forces resulting from the use of two-frequency light (bichromatic force) and swept frequency light (adiabatic rapid passage force). Both of these forces derive from stimulated processes only and as a result can produce coherent exchange of momentum between atoms and light. The consequences are impressively larger forces with comparably larger velocity capture ranges and even atom cooling without spontaneous emission.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"8ab3d2b7-b50b-460e-b086-8990cfcbd350","label":"Atomic, Molecular & Optical"}],"concepts":[{"id":"0b6b113c8f3d421ea149940af26931cf","label":"Cooling & trapping","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true}]}}}