{"id":"10.1103/RevModPhys.89.025005","title":{"value":"Quantum Hall physics: Hierarchies and conformal field theory techniques","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"RMP","abbreviatedName":"Rev. Mod. Phys.","name":"Reviews of Modern Physics"},"issue":{"number":"2"},"volume":{"number":"89"},"pageStart":"025005","hasArticleId":true,"date":"2017-05-23","numPages":61,"articleType":"article","identifiers":{"doi":"10.1103/RevModPhys.89.025005"},"rights":{"rightsStatement":"© 2017 American Physical Society","copyrightYear":2017,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"T. H. Hansson","firstname":"T. H.","surname":"Hansson","affiliationIds":["a1"]},{"type":"Person","name":"M. Hermanns","firstname":"M.","surname":"Hermanns","affiliationIds":["a2"]},{"type":"Person","name":"S. H. Simon","firstname":"S. H.","surname":"Simon","affiliationIds":["a3"]},{"type":"Person","name":"S. F. Viefers","firstname":"S. F.","surname":"Viefers","affiliationIds":["a4"]}],"affiliations":[{"id":"a1","name":"Department of Physics Stockholm University, AlbaNova University Center, 106 91 Stockholm, Sweden and Nordita, KTH Royal Institute of Technology and Stockholm University, Roslagstullsbacken 23, SE-106 91 Stockholm, Sweden"},{"id":"a2","name":"Institute for Theoretical Physics, University of Cologne, 50937 Cologne, Germany"},{"id":"a3","name":"Rudolf Peierls Centre for Theoretical Physics, University of Oxford, 1 Keble Road, Oxford OX1 3NP, United Kingdom"},{"id":"a4","name":"Department of Physics, University of Oslo, Box 1048, Blindern, 0316 Oslo, Norway"}],"abstract":{"value":"<p>The fractional quantum Hall effect, being one of the most studied phenomena in condensed matter physics during the past 30 years, has generated many ground-breaking new ideas and concepts. Very early on it was realized that the zoo of emerging states of matter would need to be understood in a systematic manner. The first attempts to do this, by Haldane and Halperin, set an agenda for further work which has continued to this day. Since that time the idea of hierarchies of quasiparticles condensing to form new states has been a pillar of our understanding of fractional quantum Hall physics. In the 30 years that have passed since then, a number of new directions of thought have advanced our understanding of fractional quantum Hall states and have extended it in new and unexpected ways. Among these directions is the extensive use of topological quantum field theories and conformal field theories, the application of the ideas of composite bosons and fermions, and the study of non-Abelian quantum Hall liquids. This article aims to present a comprehensive overview of this field, including the most recent developments.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"a48f173e-6459-4642-a711-a6e731807625","label":"Condensed Matter & Materials Physics"}],"concepts":[{"id":"9017d068f9d742f8b083a385e9b14c0b","label":"Quantum Hall effect","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true}]}}}