{"id":"10.1103/RevModPhys.89.041003","title":{"value":"<i>Colloquium</i>: Quantum coherence as a resource","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"RMP","abbreviatedName":"Rev. Mod. Phys.","name":"Reviews of Modern Physics"},"issue":{"number":"4"},"volume":{"number":"89"},"pageStart":"041003","hasArticleId":true,"date":"2017-10-30","numPages":34,"articleType":"article","identifiers":{"doi":"10.1103/RevModPhys.89.041003"},"rights":{"rightsStatement":"© 2017 American Physical Society","copyrightYear":2017,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"Alexander Streltsov","firstname":"Alexander","surname":"Streltsov","affiliationIds":["a1"]},{"type":"Person","name":"Gerardo Adesso","firstname":"Gerardo","surname":"Adesso","affiliationIds":["a2"]},{"type":"Person","name":"Martin B. Plenio","firstname":"Martin B.","surname":"Plenio","affiliationIds":["a3"]}],"affiliations":[{"id":"a1","name":"Faculty of Applied Physics and Mathematics, Gdańsk University of Technology, 80-233 Gdańsk, Poland, National Quantum Information Centre in Gdańsk, 81-824 Sopot, Poland, Dahlem Center for Complex Quantum Systems, Freie Universität Berlin, D-14195 Berlin, Germany, and ICFO—Institut de Ciències Fotòniques, The Barcelona Institute of Science and Technology, ES-08860 Castelldefels, Spain"},{"id":"a2","name":"Centre for the Mathematics and Theoretical Physics of Quantum Non-Equilibrium Systems (CQNE), School of Mathematical Sciences, The University of Nottingham, University Park, Nottingham NG7 2RD, United Kingdom"},{"id":"a3","name":"Institute of Theoretical Physics and IQST, Ulm University, Albert-Einstein-Allee 11, D-89069 Ulm, Germany"}],"abstract":{"value":"<p>The coherent superposition of states, in combination with the quantization of observables, represents one of the most fundamental features that mark the departure of quantum mechanics from the classical realm. Quantum coherence in many-body systems embodies the essence of entanglement and is an essential ingredient for a plethora of physical phenomena in quantum optics, quantum information, solid state physics, and nanoscale thermodynamics. In recent years, research on the presence and functional role of quantum coherence in biological systems has also attracted considerable interest. Despite the fundamental importance of quantum coherence, the development of a rigorous theory of quantum coherence as a physical resource has been initiated only recently. This Colloquium discusses and reviews the development of this rapidly growing research field that encompasses the characterization, quantification, manipulation, dynamical evolution, and operational application of quantum coherence.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"510fc21887744547ab09fc6cef0c9a03","label":"Quantum Information"}],"concepts":[{"id":"fa74ced7-fb7d-48bb-a88e-d601c6ae2333","label":"Quantum coherence & coherence measures","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true}]}}}