{"id":"10.1103/RevModPhys.89.045001","title":{"value":"Coupling functions: Universal insights into dynamical interaction mechanisms","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"RMP","abbreviatedName":"Rev. Mod. Phys.","name":"Reviews of Modern Physics"},"issue":{"number":"4"},"volume":{"number":"89"},"pageStart":"045001","hasArticleId":true,"date":"2017-11-06","numPages":50,"articleType":"article","identifiers":{"doi":"10.1103/RevModPhys.89.045001"},"rights":{"rightsStatement":"© 2017 American Physical Society","copyrightYear":2017,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"Tomislav Stankovski","firstname":"Tomislav","surname":"Stankovski","affiliationIds":["a1"]},{"type":"Person","name":"Tiago Pereira","firstname":"Tiago","surname":"Pereira","affiliationIds":["a2"]},{"type":"Person","name":"Peter V. E. McClintock","firstname":"Peter V. E.","surname":"McClintock","affiliationIds":["a3"]},{"type":"Person","name":"Aneta Stefanovska","firstname":"Aneta","surname":"Stefanovska","affiliationIds":["a3"]}],"affiliations":[{"id":"a1","name":"Faculty of Medicine, Ss Cyril and Methodius University, 50 Divizija 6, Skopje 1000, Macedonia and Department of Physics, Lancaster University, Lancaster, LA1 4YB, United Kingdom"},{"id":"a2","name":"Department of Mathematics, Imperial College London, London SW7 2AZ, United Kingdom and Institute of Mathematical and Computer Sciences, University of São Paulo, São Carlos 13566-590, Brazil"},{"id":"a3","name":"Department of Physics, Lancaster University, Lancaster, LA1 4YB, United Kingdom"}],"abstract":{"value":"<p>The dynamical systems found in nature are rarely isolated. Instead they interact and influence each other. The coupling functions that connect them contain detailed information about the functional mechanisms underlying the interactions and prescribe the physical rule specifying how an interaction occurs. A coherent and comprehensive review is presented encompassing the rapid progress made recently in the analysis, understanding, and applications of coupling functions. The basic concepts and characteristics of coupling functions are presented through demonstrative examples of different domains, revealing the mechanisms and emphasizing their multivariate nature. The theory of coupling functions is discussed through gradually increasing complexity from strong and weak interactions to globally coupled systems and networks. A variety of methods that have been developed for the detection and reconstruction of coupling functions from measured data is described. These methods are based on different statistical techniques for dynamical inference. Stemming from physics, such methods are being applied in diverse areas of science and technology, including chemistry, biology, physiology, neuroscience, social sciences, mechanics, and secure communications. This breadth of application illustrates the universality of coupling functions for studying the interaction mechanisms of coupled dynamical systems.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"6f025065-4b96-4156-b146-2c285d0994c4","label":"Nonlinear Dynamics"}],"concepts":[{"id":"11f78b53-5856-41bb-a6f2-78a7da00bcbf","label":"Coupled oscillators","facet":{"id":"f45b3c40-959c-4e90-ba0e-38232980802a","label":"Physical Systems"},"primary":true}]}}}