{"id":"10.1103/RevModPhys.89.041002","title":{"value":"<i>Colloquium</i>: Astromaterial science and nuclear pasta","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"RMP","abbreviatedName":"Rev. Mod. Phys.","name":"Reviews of Modern Physics"},"issue":{"number":"4"},"volume":{"number":"89"},"pageStart":"041002","hasArticleId":true,"date":"2017-10-23","numPages":13,"articleType":"article","identifiers":{"doi":"10.1103/RevModPhys.89.041002"},"rights":{"rightsStatement":"© 2017 American Physical Society","copyrightYear":2017,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"M. E. Caplan","firstname":"M. E.","surname":"Caplan","affiliationIds":["a1"]},{"type":"Person","name":"C. J. Horowitz","firstname":"C. J.","surname":"Horowitz","affiliationIds":["a1"]}],"affiliations":[{"id":"a1","name":"Center for Exploration of Energy and Matter and Department of Physics, Indiana University, Bloomington, Indiana 47405, USA"}],"abstract":{"value":"<p>“Astromaterial science” is defined as the study of materials in astronomical objects that are qualitatively denser than materials on Earth. Astromaterials can have unique properties related to their large density, although they may be organized in ways similar to more conventional materials. By analogy to terrestrial materials, this study of astromaterials is divided into hard and soft and one example of each is discussed. The hard astromaterial discussed here is a crystalline lattice, such as the Coulomb crystals in the interior of cold white dwarfs and in the crust of neutron stars, while the soft astromaterial is nuclear pasta found in the inner crusts of neutron stars. In particular, how molecular dynamics simulations have been used to calculate the properties of astromaterials to interpret observations of white dwarfs and neutron stars is discussed. Coulomb crystals are studied to understand how compact stars freeze. Their incredible strength may make crust “mountains” on rotating neutron stars a source for gravitational waves that the Laser Interferometer Gravitational-Wave Observatory (LIGO) may detect. Nuclear pasta is expected near the base of the neutron star crust at densities of <span class=\"aps-inline-formula\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\" display=\"inline\"><mrow><msup><mrow><mn>10</mn></mrow><mrow><mn>14</mn></mrow></msup><mtext> </mtext><mtext> </mtext><mi mathvariant=\"normal\">g</mi><mo>/</mo><msup><mrow><mi>cm</mi></mrow><mrow><mn>3</mn></mrow></msup></mrow></math></span>. Competition between nuclear attraction and Coulomb repulsion rearranges neutrons and protons into complex nonspherical shapes such as sheets (lasagna) or tubes (spaghetti). Semiclassical molecular dynamics simulations of nuclear pasta have been used to study these phases and calculate their transport properties such as neutrino opacity, thermal conductivity, and electrical conductivity. Observations of neutron stars may be sensitive to these properties and can be used to interpret observations of supernova neutrinos, magnetic field decay, and crust cooling of accreting neutron stars. This Colloquium concludes by comparing nuclear pasta shapes with some similar shapes seen in biological systems.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"0213a5a0-0742-43f3-804b-3ccea08a13c0","label":"Nuclear Physics"}],"concepts":[{"id":"38c3eaa1e9a745909a93cbdfd9fe162f","label":"Nuclear astrophysics","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true}]}}}