{"id":"10.1103/RevModPhys.88.015005","title":{"value":"Delayed-choice gedanken experiments and their realizations","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"RMP","abbreviatedName":"Rev. Mod. Phys.","name":"Reviews of Modern Physics"},"issue":{"number":"1"},"volume":{"number":"88"},"pageStart":"015005","hasArticleId":true,"date":"2016-03-03","numPages":25,"articleType":"article","identifiers":{"doi":"10.1103/RevModPhys.88.015005"},"rights":{"rightsStatement":"© 2016 American Physical Society","copyrightYear":2016,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"Xiao-song Ma","firstname":"Xiao-song","surname":"Ma","affiliationIds":["a1"]},{"type":"Person","name":"Johannes Kofler","firstname":"Johannes","surname":"Kofler","affiliationIds":["a2"]},{"type":"Person","name":"Anton Zeilinger","firstname":"Anton","surname":"Zeilinger","affiliationIds":["a3"]}],"affiliations":[{"id":"a1","name":"Institute for Quantum Optics and Quantum Information (IQOQI), Austrian Academy of Sciences, Boltzmanngasse 3, 1090 Vienna, Austria, Department of Electrical Engineering, Yale University, 15 Prospect Street, New Haven, Connecticut 06520, USA, and National Laboratory of Solid State Microstructures, School of Physics, Collaborative Innovation Center of Advanced Microstructures, Nanjing University, Nanjing 210093, China"},{"id":"a2","name":"Max Planck Institute of Quantum Optics (MPQ), Hans-Kopfermann-Straße 1, 85748 Garching, Germany"},{"id":"a3","name":"Vienna Center of Quantum Science and Technology (VCQ), University of Vienna, Boltzmanngasse 5, 1090 Vienna, Austria and Institute for Quantum Optics and Quantum Information (IQOQI), Austrian Academy of Sciences, Boltzmanngasse 3, 1090 Vienna, Austria"}],"abstract":{"value":"<p>The wave-particle duality dates back to Einstein’s explanation of the photoelectric effect through quanta of light and de Broglie’s hypothesis of matter waves. Quantum mechanics uses an abstract description for the behavior of physical systems such as photons, electrons, or atoms. Whether quantum predictions for single systems in an interferometric experiment allow an intuitive understanding in terms of the particle or wave picture depends on the specific configuration which is being used. In principle, this leaves open the possibility that quantum systems always behave either definitely as a particle or definitely as a wave in every experimental run by <i>a priori</i> adapting to the specific experimental situation. This is precisely what is tried to be excluded by delayed-choice experiments, in which the observer chooses to reveal the particle or wave character of a quantum system—or even a continuous transformation between the two—at a late stage of the experiment. The history of delayed-choice gedanken experiments, which can be traced back to the early days of quantum mechanics, is reviewed. Their experimental realizations, in particular, Wheeler’s delayed choice in interferometric setups as well as delayed-choice quantum erasure and entanglement swapping are discussed. The latter is particularly interesting, because it elevates the wave-particle duality of a single quantum system to an entanglement-separability duality of multiple systems.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"510fc21887744547ab09fc6cef0c9a03","label":"Quantum Information"},{"id":"8ab3d2b7-b50b-460e-b086-8990cfcbd350","label":"Atomic, Molecular & Optical"}],"concepts":[{"id":"2391532a-95f1-4c6d-a4ae-fadd54a03043","label":"Entanglement detection","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true},{"id":"6e1c9aa8-2e35-4fcf-ba26-5fcc93a4aed4","label":"Quantum information architectures & platforms","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}},{"id":"c53a574f48ce4182b627df9cbd8751ac","label":"Duality","facet":{"id":"b96dac97-ab85-4320-892d-9b245caf097f","label":"Theoretical Techniques"}}]}}}