{"id":"10.1103/RevModPhys.88.021004","title":{"value":"<i>Colloquium</i>: Topological band theory","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"RMP","abbreviatedName":"Rev. Mod. Phys.","name":"Reviews of Modern Physics"},"issue":{"number":"2"},"volume":{"number":"88"},"pageStart":"021004","hasArticleId":true,"date":"2016-06-29","numPages":37,"articleType":"article","identifiers":{"doi":"10.1103/RevModPhys.88.021004"},"rights":{"rightsStatement":"© 2016 American Physical Society","copyrightYear":2016,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"A. Bansil","firstname":"A.","surname":"Bansil","affiliationIds":["a1"]},{"type":"Person","name":"Hsin Lin","firstname":"Hsin","surname":"Lin","affiliationIds":["a2"]},{"type":"Person","name":"Tanmoy Das","firstname":"Tanmoy","surname":"Das","affiliationIds":["a3"]}],"affiliations":[{"id":"a1","name":"Department of Physics, Northeastern University, Boston, Massachusetts 02115, USA"},{"id":"a2","name":"Department of Physics, Northeastern University, Boston, Massachusetts 02115, USA, Centre for Advanced 2D Materials and Graphene Research Centre, National University of Singapore, Singapore 117546, and Department of Physics, National University of Singapore, Singapore 117542"},{"id":"a3","name":"Centre for Advanced 2D Materials and Graphene Research Centre, National University of Singapore, Singapore 117546, Department of Physics, National University of Singapore, Singapore 117542, and Theoretical Division, Los Alamos National Laboratory, Los Alamos, New Mexico 87545, USA"}],"abstract":{"value":"<p>The first-principles band theory paradigm has been a key player not only in the process of discovering new classes of topologically interesting materials, but also for identifying salient characteristics of topological states, enabling direct and sharpened confrontation between theory and experiment. This review begins by discussing underpinnings of the topological band theory, which involve a layer of analysis and interpretation for assessing topological properties of band structures beyond the standard band theory construct. Methods for evaluating topological invariants are delineated, including crystals without inversion symmetry and interacting systems. The extent to which theoretically predicted properties and protections of topological states have been verified experimentally is discussed, including work on topological crystalline insulators, disorder and interaction driven topological insulators (TIs), topological superconductors, Weyl semimetal phases, and topological phase transitions. Successful strategies for new materials discovery process are outlined. A comprehensive survey of currently predicted 2D and 3D topological materials is provided. This includes binary, ternary, and quaternary compounds, transition metal and <span class=\"aps-inline-formula\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\" display=\"inline\"><mi>f</mi></math></span>-electron materials, Weyl and 3D Dirac semimetals, complex oxides, organometallics, skutterudites, and antiperovskites. Also included is the emerging area of 2D atomically thin films beyond graphene of various elements and their alloys, functional thin films, multilayer systems, and ultrathin films of 3D TIs, all of which hold exciting promise of wide-ranging applications. This Colloquium concludes by giving a perspective on research directions where further work will broadly benefit the topological materials field.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"a48f173e-6459-4642-a711-a6e731807625","label":"Condensed Matter & Materials Physics"}],"concepts":[{"id":"326fc0a413264ccaabec2109dabaaf6b","label":"Topological field theories","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true},{"id":"0026b3bc1a2f45df80251243dac91047","label":"Topological materials","facet":{"id":"f45b3c40-959c-4e90-ba0e-38232980802a","label":"Physical Systems"}}]}}}