{"id":"10.1103/RevModPhys.88.035005","title":{"value":"Classification of topological quantum matter with symmetries","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"RMP","abbreviatedName":"Rev. Mod. Phys.","name":"Reviews of Modern Physics"},"issue":{"number":"3"},"volume":{"number":"88"},"pageStart":"035005","hasArticleId":true,"date":"2016-08-31","numPages":63,"articleType":"article","identifiers":{"doi":"10.1103/RevModPhys.88.035005"},"rights":{"rightsStatement":"© 2016 American Physical Society","copyrightYear":2016,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"Ching-Kai Chiu","firstname":"Ching-Kai","surname":"Chiu","affiliationIds":["a1"]},{"type":"Person","name":"Jeffrey C. Y. Teo","firstname":"Jeffrey C. Y.","surname":"Teo","affiliationIds":["a2"]},{"type":"Person","name":"Andreas P. Schnyder","firstname":"Andreas P.","surname":"Schnyder","affiliationIds":["a3"]},{"type":"Person","name":"Shinsei Ryu","firstname":"Shinsei","surname":"Ryu","affiliationIds":["a4"]}],"affiliations":[{"id":"a1","name":"Department of Physics and Astronomy, University of British Columbia, Vancouver, BC, Canada V6T 1Z1, and Condensed Matter Theory Center and Joint Quantum Institute, Department of Physics, University of Maryland, College Park, Maryland 20742, USA"},{"id":"a2","name":"Department of Physics, University of Virginia, Charlottesville, Virginia 22904, USA"},{"id":"a3","name":"Max-Planck-Institut für Festkörperforschung, Heisenbergstrasse 1, D-70569 Stuttgart, Germany"},{"id":"a4","name":"Department of Physics, Institute for Condensed Matter Theory, University of Illinois at Urbana-Champaign, Urbana, Illinois 61801, USA"}],"abstract":{"value":"<p>Topological materials have become the focus of intense research in recent years, since they exhibit fundamentally new physical phenomena with potential applications for novel devices and quantum information technology. One of the hallmarks of topological materials is the existence of protected gapless surface states, which arise due to a nontrivial topology of the bulk wave functions. This review provides a pedagogical introduction into the field of topological quantum matter with an emphasis on classification schemes. Both fully gapped and gapless topological materials and their classification in terms of nonspatial symmetries, such as time reversal, as well as spatial symmetries, such as reflection, are considered. Furthermore, the classification of gapless modes localized on topological defects is surveyed. The classification of these systems is discussed by use of homotopy groups, Clifford algebras, K theory, and nonlinear sigma models describing the Anderson (de)localization at the surface or inside a defect of the material. Theoretical model systems and their topological invariants are reviewed together with recent experimental results in order to provide a unified and comprehensive perspective of the field. While the bulk of this article is concerned with the topological properties of noninteracting or mean-field Hamiltonians, a brief overview of recent results and open questions concerning the topological classifications of interacting systems is also provided.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"a48f173e-6459-4642-a711-a6e731807625","label":"Condensed Matter & Materials Physics"}],"concepts":[{"id":"54b389aa-8ccf-49ee-a54e-478ccc2616eb","label":"Symmetries","facet":{"id":"42d3b740-7576-46a7-8b8f-331568a778b1","label":"Properties"}},{"id":"0026b3bc1a2f45df80251243dac91047","label":"Topological materials","facet":{"id":"f45b3c40-959c-4e90-ba0e-38232980802a","label":"Physical Systems"},"primary":true},{"id":"bfe403ee-cd34-466b-b8bf-f90b4d4431fc","label":"Topological phases of matter","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}}]}}}