{"id":"10.1103/RevModPhys.88.035006","title":{"value":"Control principles of complex systems","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"RMP","abbreviatedName":"Rev. Mod. Phys.","name":"Reviews of Modern Physics"},"issue":{"number":"3"},"volume":{"number":"88"},"pageStart":"035006","hasArticleId":true,"date":"2016-09-06","numPages":58,"articleType":"article","identifiers":{"doi":"10.1103/RevModPhys.88.035006"},"rights":{"rightsStatement":"© 2016 American Physical Society","copyrightYear":2016,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"Yang-Yu Liu","firstname":"Yang-Yu","surname":"Liu","affiliationIds":["a1"]},{"type":"Person","name":"Albert-László Barabási","firstname":"Albert-László","surname":"Barabási","affiliationIds":["a2"]}],"affiliations":[{"id":"a1","name":"Channing Division of Network Medicine, Brigham and Women’s Hospital, Harvard Medical School, Boston, Massachusetts 02115, USA and Center for Cancer Systems Biology, Dana-Farber Cancer Institute, Boston, Massachusetts 02115, USA"},{"id":"a2","name":"Center for Complex Network Research and Departments of Physics, Computer Science and Biology, Northeastern University, Boston, Massachusetts 02115, USA, Department of Medicine, Brigham and Women’s Hospital, Harvard Medical School, Boston, Massachusetts 02115, USA, and Center for Network Science, Central European University, Budapest 1052, Hungary"}],"abstract":{"value":"<p>A reflection of our ultimate understanding of a complex system is our ability to control its behavior. Typically, control has multiple prerequisites: it requires an accurate map of the network that governs the interactions between the system’s components, a quantitative description of the dynamical laws that govern the temporal behavior of each component, and an ability to influence the state and temporal behavior of a selected subset of the components. With deep roots in dynamical systems and control theory, notions of control and controllability have taken a new life recently in the study of complex networks, inspiring several fundamental questions: What are the control principles of complex systems? How do networks organize themselves to balance control with functionality? To address these questions here recent advances on the controllability and the control of complex networks are reviewed, exploring the intricate interplay between the network topology and dynamical laws. The pertinent mathematical results are matched with empirical findings and applications. Uncovering the control principles of complex systems can help us explore and ultimately understand the fundamental laws that govern their behavior.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"2bd35371-7fda-477a-8e1a-c346c797a232","label":"Polymers & Soft Matter"}],"concepts":[{"id":"c0994213-aa21-4664-bcc9-34473da8eaa9","label":"Control & applications of chaos","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true},{"id":"766cdcd9-f515-4656-afc1-7eae7766ec6c","label":"Real & complex analysis","facet":{"id":"b96dac97-ab85-4320-892d-9b245caf097f","label":"Theoretical Techniques"}},{"id":"1ec03196-e8d2-40b7-891a-fc8e4a1cbbdb","label":"Chaos & nonlinear dynamics","facet":{"id":"b96dac97-ab85-4320-892d-9b245caf097f","label":"Theoretical Techniques"}}]}}}