{"id":"10.1103/RevModPhys.88.041001","title":{"value":"<i>Colloquium</i>: Protecting quantum information against environmental noise","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"RMP","abbreviatedName":"Rev. Mod. Phys.","name":"Reviews of Modern Physics"},"issue":{"number":"4"},"volume":{"number":"88"},"pageStart":"041001","hasArticleId":true,"date":"2016-10-10","numPages":23,"articleType":"article","identifiers":{"doi":"10.1103/RevModPhys.88.041001"},"rights":{"rightsStatement":"© 2016 American Physical Society","copyrightYear":2016,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"Dieter Suter","firstname":"Dieter","surname":"Suter","affiliationIds":["a1"]},{"type":"Person","name":"Gonzalo A. Álvarez","firstname":"Gonzalo A.","surname":"Álvarez","affiliationIds":["a2"]}],"affiliations":[{"id":"a1","name":"Fakultät Physik, TU Dortmund, 44221 Dortmund, Germany"},{"id":"a2","name":"Weizmann Institute of Science, 76100 Rehovot, Israel, and Centro Atómico Bariloche, CNEA, CONICET, 8400 S. C. de Bariloche, Argentina"}],"abstract":{"value":"<p>Quantum technologies represent a rapidly evolving field in which the specific properties of quantum mechanical systems are exploited to enhance the performance of various applications such as sensing, transmission, and processing of information. Such devices can be useful only if the quantum systems also interact with their environment. However, the interactions with the environment can degrade the specific quantum properties of these systems, such as coherence and entanglement. It is therefore essential that the interaction between a quantum system and the environment is controlled in such a way that the unwanted effects of the environment are suppressed while the necessary interactions are retained. This Colloquium gives an overview, aimed at newcomers to this field, of some of the challenges that need to be overcome to achieve this goal. A number of techniques have been developed for this purpose in different areas of physics including magnetic resonance, optics, and quantum information. They include the application of static or time-dependent fields to the quantum system, which are designed to average the effect of the environmental interactions to zero. Quantum error correction schemes were developed to detect and eliminate certain errors that occur during the storage and processing of quantum information. In many physical systems, it is useful to use specific quantum states that are intrinsically less susceptible to environmental noise for encoding the quantum information. The dominant contribution to the loss of information is pure dephasing, i.e., through the loss of coherence in quantum mechanical superposition states. Accordingly, most schemes for reducing loss of information focus on dephasing processes. This is also the focus of this Colloquium.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"510fc21887744547ab09fc6cef0c9a03","label":"Quantum Information"}],"concepts":[{"id":"fce63f544c304bd4b3b61a4d58bdaceb","label":"Open quantum systems & decoherence","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true}]}}}