{"id":"10.1103/RevModPhys.88.021002","title":{"value":"<i>Colloquium</i>: Non-Markovian dynamics in open quantum systems","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"RMP","abbreviatedName":"Rev. Mod. Phys.","name":"Reviews of Modern Physics"},"issue":{"number":"2"},"volume":{"number":"88"},"pageStart":"021002","hasArticleId":true,"date":"2016-04-19","numPages":24,"articleType":"article","identifiers":{"doi":"10.1103/RevModPhys.88.021002"},"rights":{"rightsStatement":"© 2016 American Physical Society","copyrightYear":2016,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"Heinz-Peter Breuer","firstname":"Heinz-Peter","surname":"Breuer","affiliationIds":["a1"]},{"type":"Person","name":"Elsi-Mari Laine","firstname":"Elsi-Mari","surname":"Laine","affiliationIds":["a2"]},{"type":"Person","name":"Jyrki Piilo","firstname":"Jyrki","surname":"Piilo","affiliationIds":["a3"]},{"type":"Person","name":"Bassano Vacchini","firstname":"Bassano","surname":"Vacchini","affiliationIds":["a4"]}],"affiliations":[{"id":"a1","name":"Physikalisches Institut, Universität Freiburg, Hermann-Herder-Straße 3, D-79104 Freiburg, Germany"},{"id":"a2","name":"QCD Labs, COMP Centre of Excellence, Department of Applied Physics, Aalto University, P.O. Box 13500, FI-00076 AALTO, Finland and Turku Centre for Quantum Physics, Department of Physics and Astronomy, University of Turku, FI-20014 Turun yliopisto, Finland"},{"id":"a3","name":"Turku Centre for Quantum Physics, Department of Physics and Astronomy, University of Turku, FI-20014 Turun yliopisto, Finland"},{"id":"a4","name":"Dipartimento di Fisica, Università degli Studi di Milano, Via Celoria 16, I-20133 Milan, Italy and INFN, Sezione di Milano, Via Celoria 16, I-20133 Milan, Italy"}],"abstract":{"value":"<p>The dynamical behavior of open quantum systems plays a key role in many applications of quantum mechanics, examples ranging from fundamental problems, such as the environment-induced decay of quantum coherence and relaxation in many-body systems, to applications in condensed matter theory, quantum transport, quantum chemistry, and quantum information. In close analogy to a classical Markovian stochastic process, the interaction of an open quantum system with a noisy environment is often modeled phenomenologically by means of a dynamical semigroup with a corresponding time-independent generator in Lindblad form, which describes a memoryless dynamics of the open system typically leading to an irreversible loss of characteristic quantum features. However, in many applications open systems exhibit pronounced memory effects and a revival of genuine quantum properties such as quantum coherence, correlations, and entanglement. Here recent theoretical results on the rich non-Markovian quantum dynamics of open systems are discussed, paying particular attention to the rigorous mathematical definition, to the physical interpretation and classification, as well as to the quantification of quantum memory effects. The general theory is illustrated by a series of physical examples. The analysis reveals that memory effects of the open system dynamics reflect characteristic features of the environment which opens a new perspective for applications, namely, to exploit a small open system as a quantum probe signifying nontrivial features of the environment it is interacting with. This Colloquium further explores the various physical sources of non-Markovian quantum dynamics, such as structured environmental spectral densities, nonlocal correlations between environmental degrees of freedom, and correlations in the initial system-environment state, in addition to developing schemes for their local detection. Recent experiments addressing the detection, quantification, and control of non-Markovian quantum dynamics are also briefly discussed.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"8ab3d2b7-b50b-460e-b086-8990cfcbd350","label":"Atomic, Molecular & Optical"}],"concepts":[{"id":"fce63f544c304bd4b3b61a4d58bdaceb","label":"Open quantum systems & decoherence","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true},{"id":"25a98813-4461-40e1-97be-e5e2dd8fb570","label":"Non-Markovian processes","facet":{"id":"b96dac97-ab85-4320-892d-9b245caf097f","label":"Theoretical Techniques"}}]}}}