{"id":"10.1103/PhysRevFluids.1.044404","title":{"value":"Mean kinetic energy transport and event classification in a model wind turbine array versus an array of porous disks: Energy budget and octant analysis","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"PRFLUIDS","abbreviatedName":"Phys. Rev. Fluids","name":"Physical Review Fluids"},"issue":{"number":"4"},"volume":{"number":"1"},"pageStart":"044404","hasArticleId":true,"date":"2016-08-01","numPages":19,"articleType":"article","identifiers":{"doi":"10.1103/PhysRevFluids.1.044404"},"rights":{"rightsStatement":"©2016 American Physical Society","copyrightYear":2016,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"Elizabeth H. Camp","firstname":"Elizabeth H.","surname":"Camp","affiliationIds":["a1"]},{"type":"Person","name":"Raúl Bayoán Cal","firstname":"Raúl Bayoán","surname":"Cal","affiliationIds":["a1"]}],"affiliations":[{"id":"a1","name":"Department of Mechanical and Materials Engineering, Portland State University, Portland, Oregon 97201, USA"}],"abstract":{"value":"<p>An array of model rotating wind turbines is compared experimentally to an array of static porous disks in order to quantify the similarities and differences in the mean kinetic energy transport within the wakes produced in these two cases. Stereo particle image velocimetry measurements are done in a wind tunnel bracketing the center turbine in the fourth row of a <span class=\"aps-inline-formula\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><mrow><mn>4</mn><mo>×</mo><mn>3</mn></mrow></math></span> array of model turbines. Equivalent sets of rotors and porous disks are created by matching their respective induction factors. The primary difference in the mean velocity components is found in the spanwise mean velocity component, which is as much as 190% different between the rotor and disk case. Horizontal averages of mean kinetic energy transport terms in the region where rotation is most important show percent differences in the range 3%–41%, which decrease to 1%–6% at streamwise coordinates where rotation is less important. Octant analysis is performed on the most significant term related to vertical mean kinetic energy flux <span class=\"aps-inline-formula\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><mrow><mover><mrow><msup><mi>u</mi><mo>′</mo></msup><msup><mi>v</mi><mo>′</mo></msup></mrow><mo>¯</mo></mover><mi>U</mi></mrow></math></span>. The average percent difference between corresponding octants is as much as 68% different in the near wake and as much as 17% different in the far wake. Furthermore, octant analysis elucidates the three-dimensional nature of sweeps and ejections in the near wake of the rotor case. Together, these results imply that a stationary porous disk adequately represents the mean kinetic energy transport of a rotor in the far wake where rotation is less important, while significant discrepancies exist at streamwise locations where rotation is a key phenomenon. This comparison has implications in the use of an actuator disk to model the wind turbine rotor in computational simulations specifically for studies where Reynolds stresses, turbulence intensity, or interactions with the atmosphere are of interest.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"512fd433-7b6d-4535-bb60-78f3bf431bc3","label":"Fluid Dynamics"}],"concepts":[{"id":"4c984e2a-a745-480a-8a33-f96574b3bf03","label":"Wakes & jets","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}},{"id":"ad1edc29-450c-4872-86ea-0034e0815b2e","label":"Atmospheric fluid dynamics","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}},{"id":"062f0300c33d4782b24c43996b0469f3","label":"Turbulence","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true}]}}}