{"id":"10.1103/PhysRevFluids.1.074102","title":{"value":"Effective slip boundary conditions for sinusoidally corrugated surfaces","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"PRFLUIDS","abbreviatedName":"Phys. Rev. Fluids","name":"Physical Review Fluids"},"issue":{"number":"7"},"volume":{"number":"1"},"pageStart":"074102","hasArticleId":true,"date":"2016-11-17","numPages":22,"articleType":"article","identifiers":{"doi":"10.1103/PhysRevFluids.1.074102"},"rights":{"rightsStatement":"©2016 American Physical Society","copyrightYear":2016,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"Lin Guo","firstname":"Lin","surname":"Guo","affiliationIds":["a1"]},{"type":"Person","name":"Shiyi Chen","firstname":"Shiyi","surname":"Chen","affiliationIds":["a1","a2"]},{"type":"Person","name":"Mark O. Robbins","firstname":"Mark O.","surname":"Robbins","affiliationIds":["a1","a3"]}],"affiliations":[{"id":"a1","name":"Department of Mechanical Engineering, Johns Hopkins University, Baltimore, Maryland 21218, USA"},{"id":"a2","name":"South University of Science and Technology, Shenzhen, Guangdong 518055, China"},{"id":"a3","name":"Department of Physics and Astronomy, Johns Hopkins University, Baltimore, Maryland 21218, USA"}],"abstract":{"value":"<p>Molecular dynamics simulations are used to investigate the effective slip boundary condition for a simple fluid flowing over surfaces with one-dimensional sinusoidal roughness in the Wenzel state. The effective slip length is calculated as a function of the corrugation amplitude for flows along two principal orientations: transverse and longitudinal to the corrugation. Different atomic configurations, bent and stepped, are examined for strong and weak wall-fluid interactions and high and low wall densities. Molecular dynamics results for sparse bent surfaces quantitatively agree with continuum hydrodynamic predictions with a constant local slip length. Increasing the roughness amplitude reduces the effective slip length and the reduction is larger for transverse flow than longitudinal flow. Atomic effects become important for dense surfaces, because the local slip length varies with the local curvature and atomic spacing along the wall. These effects can be captured by applying a spatially varying boundary condition to the Navier-Stokes equations. Results for stepped surfaces are qualitatively different than continuum predictions, with the effect of corrugation rising linearly with corrugation amplitude rather than quadratically. There is an increased drag for transverse flow that is proportional to the density of step edges and lowers the slip length. Edges tend to increase the slip length for longitudinal flow because of order induced along the edges.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"a48f173e-6459-4642-a711-a6e731807625","label":"Condensed Matter & Materials Physics"},{"id":"512fd433-7b6d-4535-bb60-78f3bf431bc3","label":"Fluid Dynamics"}],"concepts":[{"id":"e648e4c6-3242-41ba-8ee9-212300b7a8fd","label":"Noncontinuum effects in nanoscale flows","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true},{"id":"c7102703-2c55-4648-bf60-11f0f66a1256","label":"Nanoscale flows","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}},{"id":"edff6507-ef6e-4655-88ac-33fa3e31b6fb","label":"Microscale flows","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}}]}}}