{"id":"10.1103/PhysRevFluids.1.073501","title":{"value":"Investigation of airfoil leading edge separation control with nanosecond plasma actuator","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"PRFLUIDS","abbreviatedName":"Phys. Rev. Fluids","name":"Physical Review Fluids"},"issue":{"number":"7"},"volume":{"number":"1"},"pageStart":"073501","hasArticleId":true,"date":"2016-11-22","numPages":30,"articleType":"article","identifiers":{"doi":"10.1103/PhysRevFluids.1.073501"},"rights":{"rightsStatement":"©2016 American Physical Society","copyrightYear":2016,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"J. G. Zheng","firstname":"J. G.","surname":"Zheng","affiliationIds":["a1"]},{"type":"Person","name":"Y. D. Cui","firstname":"Y. D.","surname":"Cui","affiliationIds":["a1"]},{"type":"Person","name":"Z. J. Zhao","firstname":"Z. J.","surname":"Zhao","affiliationIds":["a1"]},{"type":"Person","name":"J. Li","firstname":"J.","surname":"Li","affiliationIds":["a1"]},{"type":"Person","name":"B. C. Khoo","firstname":"B. C.","surname":"Khoo","affiliationIds":["a1","a2"]}],"affiliations":[{"id":"a1","name":"Temasek Laboratories, National University of Singapore, Singapore 117411"},{"id":"a2","name":"Department of Mechanical Engineering, National University of Singapore, Singapore 119260"}],"abstract":{"value":"<p>A combined numerical and experimental investigation of airfoil leading edge flow separation control with a nanosecond dielectric barrier discharge (DBD) plasma actuator is presented. Our study concentrates on describing dynamics of detailed flow actuation process and elucidating the nanosecond DBD actuation mechanism. A loose coupling methodology is employed to perform simulation, which consists of a self-similar plasma model for the description of pulsed discharge and two-dimensional Reynolds averaged Navier-Stokes (RANS) equations for the calculation of external airflow. A series of simulations of poststall flows around a NACA0015 airfoil is conducted with a Reynolds number range covering both low and high Re at <span class=\"aps-inline-formula\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><mrow><mtext>Re</mtext><mo>=</mo><mrow><mo>(</mo><mn>0.05</mn><mo>,</mo><mspace width=\"0.16em\"></mspace><mn>0.15</mn><mo>,</mo><mspace width=\"0.16em\"></mspace><mn>1.2</mn><mo>)</mo></mrow><mo>×</mo><msup><mn>10</mn><mn>6</mn></msup></mrow></math></span>. Meanwhile, wind-tunnel experiment is performed for two low Re flows to measure aerodynamic force on airfoil model and transient flow field with time-resolved particle image velocimetry (PIV). The PIV measurement provides possibly the clearest view of flow reattachment process under the actuation of a nanosecond plasma actuator ever observed in experiments, which is highly comparable to that predicted by simulation. It is found from the detailed simulation that the discharge-induced residual heat rather than shock wave plays a dominant role in flow control. For any leading edge separations, the preliminary flow reattachment is realized by residual heat-induced spanwise vortices. After that, the nanosecond actuator functions by continuing exciting flow instability at poststall attack angles or acting as an active trip near stall angle. As a result, the controlled flow is characterized by a train of repetitive, downstream moving vortices over suction surface or an attached turbulent boundary layer, which depends on both angle of attack and Reynolds number. The advection of residual temperature with external flow offers a nanosecond plasma actuator a lot of flexibility to extend its influence region. Animations are provided for baseline flow and that subjected to plasma control at two typical Reynolds numbers.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"512fd433-7b6d-4535-bb60-78f3bf431bc3","label":"Fluid Dynamics"}],"concepts":[{"id":"d2fd5563-5077-41b4-9d06-f0da03883073","label":"Flow instability","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}},{"id":"8e117b54-7f83-4338-928f-e41ed5d2de22","label":"Shear layers","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}},{"id":"9cf04270-c27c-4351-8840-9d94a7d19eea","label":"Instability control","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true}]}}}