{"id":"10.1103/PhysRevFluids.1.023901","title":{"value":"Faraday instability of a two-layer liquid film with a free upper surface","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"PRFLUIDS","abbreviatedName":"Phys. Rev. Fluids","name":"Physical Review Fluids"},"issue":{"number":"2"},"volume":{"number":"1"},"pageStart":"023901","hasArticleId":true,"date":"2016-06-07","numPages":18,"articleType":"article","identifiers":{"doi":"10.1103/PhysRevFluids.1.023901"},"rights":{"rightsStatement":"©2016 American Physical Society","copyrightYear":2016,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"Andrey Pototsky","firstname":"Andrey","surname":"Pototsky","affiliationIds":["a1"]},{"type":"Person","name":"Michael Bestehorn","firstname":"Michael","surname":"Bestehorn","affiliationIds":["a2"]}],"affiliations":[{"id":"a1","name":"Department of Mathematics, Faculty of Science Engineering and Technology, Swinburne University of Technology, Hawthorn, Victoria 3122, Australia"},{"id":"a2","name":"Department of Statistical Physics and Nonlinear Dynamics, Brandenburg University of Technology, 03044 Cottbus-Senftenberg, Germany"}],"abstract":{"value":"<p>We study the linear stability of a laterally extended flat two-layer liquid film under the influence of external vertical vibration. The first liquid layer rests on a vibrating solid plate and is overlaid by a second layer of immiscible fluid with deformable upper surface. Surface waves, excited as the result of the Faraday instability, can be characterized by a time-dependent relative amplitude of the displacements of the liquid-liquid and the liquid-gas interfaces. The in-phase displacements are associated with a zigzag (barotropic) mode and the antiphase displacement corresponds to the varicose thinning mode. We numerically determine the stability threshold in the vibrated two-layer film and compute the dispersion relation together with the decay rates of the surface waves in the absence of vibration. The in-phase and the antiphase displacements are strongly coupled in the vibrated system. The interplay between the Faraday and the Rayleigh-Taylor instabilities in the system with heavier fluid on top of a lighter fluid is analyzed.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"512fd433-7b6d-4535-bb60-78f3bf431bc3","label":"Fluid Dynamics"}],"concepts":[{"id":"cd96a15b-7a3d-41a0-b914-072e0941bbb8","label":"Thin fluid films","facet":{"id":"f45b3c40-959c-4e90-ba0e-38232980802a","label":"Physical Systems"},"primary":true},{"id":"42ec6252-ac7f-42bd-9ddc-08ac45a4b4e9","label":"Surface instabilities","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}}]}}}