{"id":"10.1103/PhysRevFluids.1.022401","title":{"value":"Influence of spatial exclusion on the statistical behavior of attached eddies","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"PRFLUIDS","abbreviatedName":"Phys. Rev. Fluids","name":"Physical Review Fluids"},"issue":{"number":"2"},"volume":{"number":"1"},"pageStart":"022401","hasArticleId":true,"date":"2016-06-17","numPages":7,"articleType":"rapid","identifiers":{"doi":"10.1103/PhysRevFluids.1.022401"},"rights":{"rightsStatement":"©2016 American Physical Society","copyrightYear":2016,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"Charitha M. de Silva","firstname":"Charitha M.","surname":"de Silva","affiliationIds":["a1"]},{"type":"Person","name":"James D. Woodcock","firstname":"James D.","surname":"Woodcock","affiliationIds":["a1"]},{"type":"Person","name":"Nicholas Hutchins","firstname":"Nicholas","surname":"Hutchins","affiliationIds":["a1"]},{"type":"Person","name":"Ivan Marusic","firstname":"Ivan","surname":"Marusic","affiliationIds":["a1"]}],"affiliations":[{"id":"a1","name":"Department of Mechanical Engineering, University of Melbourne, Victoria 3010, Australia"}],"abstract":{"value":"<p>Recent studies have shown Townsend's attached eddy hypothesis to be a promising basis for modeling the velocity statistics in the logarithmic region of turbulent wall flows. Accordingly, the attached eddy model is able to reliably estimate the functional forms of the mean velocity, second-order moments of the velocity fluctuations, and recently structure functions and higher-order moments of the velocity fluctuations. However, detailed quantitative comparisons with experimental results reveal differences, particularly for the higher-order moments. Specifically, the predicted flatness (kurtosis) is found to be invariably greater than 3 (i.e., super-Gaussian behavior) for all velocity components, while experimental results show sub-Gaussian behavior for the streamwise component of velocity. In this study, we show that this and other discrepancies can be resolved by considering the finite space occupied by each eddy. Earlier models had allowed each eddy to be perfectly randomly located, with no consideration for the locations of neighboring eddies (in other words, their locations can be described as a Poisson point process). Here we investigate the effect of mandating a minimum distance between any two eddies of the same height. We demonstrate that this spatial exclusion, when combined with an experimentally observed shape for the representative eddy, produces predictions that are now in better agreement with experimental observations. In particular, sub-Gaussian behavior is now attained for the streamwise component, while super-Gaussian behavior is maintained for the other velocity components, qualitatively matching experimental findings. Therefore, our findings infer that spatial exclusion between eddies is likely to play an important role in the laws that govern their spatial arrangement, which is likely to be more disperse than a Poisson point process.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"512fd433-7b6d-4535-bb60-78f3bf431bc3","label":"Fluid Dynamics"}],"concepts":[{"id":"062f0300c33d4782b24c43996b0469f3","label":"Turbulence","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}},{"id":"10c138e7-fbf9-4875-938c-c1e84ad5e598","label":"Structure & turbulence of boundary layers","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true}]}}}