{"id":"10.1103/PhysRevFluids.1.063701","title":{"value":"Influence of the Coriolis force on the structure and evolution of wind turbine wakes","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"PRFLUIDS","abbreviatedName":"Phys. Rev. Fluids","name":"Physical Review Fluids"},"issue":{"number":"6"},"volume":{"number":"1"},"pageStart":"063701","hasArticleId":true,"date":"2016-10-24","numPages":14,"articleType":"article","identifiers":{"doi":"10.1103/PhysRevFluids.1.063701"},"rights":{"rightsStatement":"©2016 American Physical Society","copyrightYear":2016,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"Mahdi Abkar","firstname":"Mahdi","surname":"Abkar","affiliationIds":["a1"]},{"type":"Person","name":"Fernando Porté-Agel","firstname":"Fernando","surname":"Porté-Agel","affiliationIds":["a2"]}],"affiliations":[{"id":"a1","name":"Wind Engineering and Renewable Energy Laboratory (WiRE), École Polytechnique Fédérale de Lausanne (EPFL), 1015 Lausanne, Switzerland and Center for Turbulence Research, Stanford University, Stanford, California 94305, USA"},{"id":"a2","name":"Wind Engineering and Renewable Energy Laboratory (WiRE), École Polytechnique Fédérale de Lausanne (EPFL), 1015 Lausanne, Switzerland"}],"abstract":{"value":"<p>In this study, large-eddy simulation combined with a turbine model is used to investigate the effect of vertical wind veer associated with the Coriolis force on the structure and evolution of wind turbine wakes. In order to isolate the Coriolis effect on the wake, two cases are considered. In the first case, atmospheric boundary-layer flow is driven by a geostrophic wind, including the effect of Earth's rotation and the Coriolis force. In the second case, the boundary-layer flow is unidirectional and is forced by an imposed pressure gradient. Both cases have the same mean horizontal velocity and turbulence intensity at the hub height. The simulation results show that the Coriolis force significantly affects the aerodynamics of the wake including the mean velocity deficit, turbulence statistics, and wake-meandering characteristics downwind of the turbine. In particular, when the flow is forced by a geostrophic wind, vertical wind veer causes a skewed spatial structure in the wake. Moreover, the presence of lateral wind shear, in addition to the vertical one, enhances the shear production of turbulent kinetic energy and the turbulent momentum flux. This leads to a larger flow entrainment and, thus, a faster wake recovery compared to the case forced by unidirectional pressure gradient. Consistent with this result, wake meandering is also stronger in both lateral and vertical directions in the case of geostrophic forcing compared to the case with pressure-gradient forcing.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"512fd433-7b6d-4535-bb60-78f3bf431bc3","label":"Fluid Dynamics"}],"concepts":[{"id":"ad1edc29-450c-4872-86ea-0034e0815b2e","label":"Atmospheric fluid dynamics","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true}]}}}