{"id":"10.1103/PhysRevFluids.1.063901","title":{"value":"Instability of nanometric fluid films on a thermally conductive substrate","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"PRFLUIDS","abbreviatedName":"Phys. Rev. Fluids","name":"Physical Review Fluids"},"issue":{"number":"6"},"volume":{"number":"1"},"pageStart":"063901","hasArticleId":true,"date":"2016-10-03","numPages":16,"articleType":"article","identifiers":{"doi":"10.1103/PhysRevFluids.1.063901"},"rights":{"rightsStatement":"©2016 American Physical Society","copyrightYear":2016,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"N. Dong","firstname":"N.","surname":"Dong","affiliationIds":["a1"]},{"type":"Person","name":"L. Kondic","firstname":"L.","surname":"Kondic","affiliationIds":["a1"]}],"affiliations":[{"id":"a1","name":"Department of Mathematical Sciences, New Jersey Institute of Technology, Newark, New Jersey 07102, USA"}],"abstract":{"value":"<p>We consider thin fluid films placed on thermally conductive substrates and exposed to a time-dependent spatially uniform heat source. The evolution of the films is considered within the long-wave framework in the regime such that both fluid-substrate interaction, modeled via disjoining pressure, and Marangoni forces are relevant. We analyze the problem by the means of linear stability analysis as well as time-dependent nonlinear simulations. The main finding is that when self-consistent computation of the temperature field is performed, a complex interplay of different instability mechanisms results. This includes either monotonous or oscillatory dynamics of the free surface. This oscillatory behavior is absent if the film temperature is assumed to be slaved to the current value of the film thickness. The results are discussed within the context of liquid metal films but are of relevance to dynamics of any thin film involving variable temperature of the free surface, such that the temperature and the film interface itself evolve on comparable time scales.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"512fd433-7b6d-4535-bb60-78f3bf431bc3","label":"Fluid Dynamics"}],"concepts":[{"id":"f5372742-fa5e-4bda-96ba-87e45d98bae6","label":"Interfacial flows","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true}]}}}