{"id":"10.1103/PhysRevFluids.1.060502","title":{"value":"Structure, biomimetics, and fluid dynamics of fish skin surfaces","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"PRFLUIDS","abbreviatedName":"Phys. Rev. Fluids","name":"Physical Review Fluids"},"issue":{"number":"6"},"volume":{"number":"1"},"pageStart":"060502","hasArticleId":true,"date":"2016-10-18","numPages":18,"articleType":"article","identifiers":{"doi":"10.1103/PhysRevFluids.1.060502"},"rights":{"rightsStatement":"©2016 American Physical Society","copyrightYear":2016,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"George V. Lauder","firstname":"George V.","surname":"Lauder","affiliationIds":["a1"]},{"type":"Person","name":"Dylan K. Wainwright","firstname":"Dylan K.","surname":"Wainwright","affiliationIds":["a1"]},{"type":"Person","name":"August G. Domel","firstname":"August G.","surname":"Domel","affiliationIds":["a2"]},{"type":"Person","name":"James C. Weaver","firstname":"James C.","surname":"Weaver","affiliationIds":["a3"]},{"type":"Person","name":"Li Wen","firstname":"Li","surname":"Wen","affiliationIds":["a4"]},{"type":"Person","name":"Katia Bertoldi","firstname":"Katia","surname":"Bertoldi","affiliationIds":["a2"]}],"affiliations":[{"id":"a1","name":"Museum of Comparative Zoology and Department of Organismic and Evolutionary Biology, Harvard University, Cambridge, Massachusetts 02138, USA"},{"id":"a2","name":"School of Engineering and Applied Sciences, Harvard University, Cambridge, Massachusetts 02138, USA"},{"id":"a3","name":"Wyss Institute for Biologically Inspired Engineering, Harvard University, Cambridge, Massachusetts 02138, USA"},{"id":"a4","name":"School of Mechanical Engineering and Automation, Beihang University, Beijing, 100191, People's Republic of China"}],"abstract":{"value":"<p>The interface between the fluid environment and the surface of the body in swimming fishes is critical for both physiological and hydrodynamic functions. The skin surface in most species of fishes is covered with bony scales or toothlike denticles (in sharks). Despite the apparent importance of fish surfaces for understanding aquatic locomotion and near-surface boundary layer flows, relatively little attention has been paid to either the nature of surface textures in fishes or possible hydrodynamic effects of variation in roughness around the body surface within an individual and among species. Fish surfaces are remarkably diverse and in many bony fishes scales can have an intricate surface texture with projections, ridges, and comblike extensions. Shark denticles (or scales) are toothlike and project out of the skin to form a complexly textured surface that interacts with free-stream flow. Manufacturing biomimetic foils with fishlike surfaces allows hydrodynamic testing and we emphasize here the importance of dynamic test conditions where the effect of surface textures is assessed under conditions of self-propulsion. We show that simple two-dimensional foils with patterned cuts do not perform as well as a smooth control surface, but that biomimetic shark skin foils can swim at higher self-propelled speeds than smooth controls. When the arrangement of denticles on the foil surface is altered, we find that a staggered-overlapped pattern outperforms other arrangements. Flexible foils made of real shark skin outperform sanded controls when foils are moved with a biologically realistic motion program. We suggest that focus on the mechanisms of drag reduction by fish surfaces has been too limiting and an additional role of fish surface textures may be to alter leading edge vortices and flow patterns on moving surfaces in a way that enhances thrust. Analysis of water flow over an artificial shark skin foil under both static and dynamic conditions shows that a shear layer develops over the denticle surface and we propose that there is limited flow under the expanded surfaces of shark denticles. The diversity of fish scale types and textures and the effect of these surfaces on boundary layer flows and fish locomotor energetics is a rich area for future investigation.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"512fd433-7b6d-4535-bb60-78f3bf431bc3","label":"Fluid Dynamics"}],"concepts":[{"id":"0c2f74cc-42b0-4b3a-b470-cd50aa7d0f89","label":"Boundary layers","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}},{"id":"74e68502-450a-4f2d-aba2-e105b7f6cc72","label":"Locomotion","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}},{"id":"21804fac-0546-45ed-98d5-b6af0f0d3228","label":"Biological fluid dynamics","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true}]}}}