{"id":"10.1103/PhysRevFluids.1.060505","title":{"value":"Flows driven by libration, precession, and tides in planetary cores","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"PRFLUIDS","abbreviatedName":"Phys. Rev. Fluids","name":"Physical Review Fluids"},"issue":{"number":"6"},"volume":{"number":"1"},"pageStart":"060505","hasArticleId":true,"date":"2016-10-18","numPages":12,"articleType":"article","identifiers":{"doi":"10.1103/PhysRevFluids.1.060505"},"rights":{"rightsStatement":"©2016 American Physical Society","copyrightYear":2016,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"Michael Le Bars","firstname":"Michael","surname":"Le Bars","affiliationIds":["a1"]}],"affiliations":[{"id":"a1","name":"CNRS, Aix Marseille Université, Centrale Marseille, IRPHE, UMR No. 7342, Marseille, France"}],"abstract":{"value":"<p>Understanding the flows in planetary cores, i.e., the large liquid iron oceans hidden in the central part of terrestrial planets, is a tremendous interdisciplinary challenge, at the frontier of fundamental fluid dynamics and planetary sciences. Beyond buoyancy driven flows that constitute the standard model for core fluid dynamics, an increasing amount of research has focused on the rotational dynamics of these spinning systems, periodically perturbed by tides, precession, and libration. Although of small amplitude, those harmonic forcings are capable of exciting resonant instabilities in planetary cores, providing alternative routes towards turbulence and magnetic field generation. In this paper I provide an overview of some recent works on this field, focusing on the mechanisms of tide and libration driven elliptical instabilities. Combined laboratory experiments and pioneering numerical simulations have allowed a full description of the stability and linear state of these flows, as well as the investigation of some convincing planetary applications. Open questions now remain regarding the nonlinear saturation of the excited flows as well as their dynamo capability. These will undoubtedly be the focus of future research, in the context of intense activity in planetary exploration of our solar system and others, which highlights the need to go beyond the standard convective models.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"512fd433-7b6d-4535-bb60-78f3bf431bc3","label":"Fluid Dynamics"}],"concepts":[{"id":"c25108e7-4697-4565-b484-221b808d454e","label":"Magnetohydrodynamics","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}},{"id":"062f0300c33d4782b24c43996b0469f3","label":"Turbulence","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}},{"id":"0bcf3ac1-4647-4b3c-9ee5-d09eb8a1bde6","label":"Rotating geophysical flows","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true},{"id":"d2fd5563-5077-41b4-9d06-f0da03883073","label":"Flow instability","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}}]}}}