{"id":"10.1103/PhysRevFluids.1.044101","title":{"value":"Inertial destabilization of highly viscous microfluidic stratifications","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"PRFLUIDS","abbreviatedName":"Phys. Rev. Fluids","name":"Physical Review Fluids"},"issue":{"number":"4"},"volume":{"number":"1"},"pageStart":"044101","hasArticleId":true,"date":"2016-08-12","numPages":18,"articleType":"article","identifiers":{"doi":"10.1103/PhysRevFluids.1.044101"},"rights":{"rightsStatement":"©2016 American Physical Society","copyrightYear":2016,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"Xiaoyi Hu","firstname":"Xiaoyi","surname":"Hu","affiliationIds":["a1"]},{"type":"Person","name":"Thomas Cubaud","firstname":"Thomas","surname":"Cubaud","affiliationIds":["a1"]}],"affiliations":[{"id":"a1","name":"Department of Mechanical Engineering, Stony Brook University, Stony Brook, New York 11794, USA"}],"abstract":{"value":"<p>The hydrodynamic stability of stratifications made between miscible fluids having large differences in viscosity is experimentally investigated in square microchannels. Parallel fluid layers with a fast central stream and a slow sheath flow are produced by focusing a low-viscosity fluid into a high-viscosity fluid in a straight microchannel. Three regimes are identified and include diffusive, stable, and unstable flow patterns. In the unstable regime, coupled interfacial waves are seen to significantly disrupt strata when the Reynolds number associated with the low-viscosity stream is above 90. Several functional relationships are developed for the stratification width, propagating celerity, wavelength, amplitude, and frequency of interfacial waves over a range of viscosities and flow rates. We demonstrate, in particular, the wave phase locking for small central streams and show the production of high-viscosity fluid ligaments at the wave crests. In this case, a minute amount of high-viscosity fluid is entrained and blended into the low-viscosity fluid stream, thereby providing an original in-line mixing method for continuously adding a viscosifier to a thin fluid in microchannels.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"512fd433-7b6d-4535-bb60-78f3bf431bc3","label":"Fluid Dynamics"}],"concepts":[{"id":"edff6507-ef6e-4655-88ac-33fa3e31b6fb","label":"Microscale flows","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true},{"id":"9794a926-9d59-4c60-a64a-e2a88ff3b421","label":"Traveling waves","facet":{"id":"f45b3c40-959c-4e90-ba0e-38232980802a","label":"Physical Systems"}}]}}}