{"id":"10.1103/PhysRevFluids.1.033202","title":{"value":"Linear drag law for high-Reynolds-number flow past an oscillating body","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"PRFLUIDS","abbreviatedName":"Phys. Rev. Fluids","name":"Physical Review Fluids"},"issue":{"number":"3"},"volume":{"number":"1"},"pageStart":"033202","hasArticleId":true,"date":"2016-07-11","numPages":14,"articleType":"article","identifiers":{"doi":"10.1103/PhysRevFluids.1.033202"},"rights":{"rightsStatement":"©2016 American Physical Society","copyrightYear":2016,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"Natalie Agre","firstname":"Natalie","surname":"Agre","affiliationIds":["a1"]},{"type":"Person","name":"Stephen Childress","firstname":"Stephen","surname":"Childress","affiliationIds":["a1"]},{"type":"Person","name":"Jun Zhang","firstname":"Jun","surname":"Zhang","affiliationIds":["a1","a2"]},{"type":"Person","name":"Leif Ristroph","firstname":"Leif","surname":"Ristroph","affiliationIds":["a1"]}],"affiliations":[{"id":"a1","name":"Applied Math Laboratory, Courant Institute, New York University, New York, New York 10012, USA"},{"id":"a2","name":"Department of Physics, New York University, New York, New York 10003, USA and Department of Physics, New York University Shanghai, Pudong, Shanghai 200122, China"}],"abstract":{"value":"<p>An object immersed in a fast flow typically experiences fluid forces that increase with the square of speed. Here we explore how this high-Reynolds-number force-speed relationship is affected by unsteady motions of a body. Experiments on disks that are driven to oscillate while progressing through air reveal two distinct regimes: a conventional quadratic relationship for slow oscillations and an anomalous scaling for fast flapping in which the time-averaged drag increases linearly with flow speed. In the linear regime, flow visualization shows that a pair of counterrotating vortices is shed with each oscillation and a model that views a train of such dipoles as a momentum jet reproduces the linearity. We also show that appropriate scaling variables collapse the experimental data from both regimes and for different oscillatory motions into a single drag-speed relationship. These results could provide insight into the aerodynamic resistance incurred by oscillating wings in flight and they suggest that vibrations can be an effective means to actively control the drag on an object.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"512fd433-7b6d-4535-bb60-78f3bf431bc3","label":"Fluid Dynamics"}],"concepts":[{"id":"a4ca1a7e-639b-4ff5-8cf3-44b60866fb3e","label":"Aerodynamics","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true}]}}}