{"id":"10.1103/PhysRevFluids.1.043601","title":{"value":"Numerical simulations of magnetohydrodynamic flows driven by a moving permanent magnet","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"PRFLUIDS","abbreviatedName":"Phys. Rev. Fluids","name":"Physical Review Fluids"},"issue":{"number":"4"},"volume":{"number":"1"},"pageStart":"043601","hasArticleId":true,"date":"2016-08-01","numPages":24,"articleType":"article","identifiers":{"doi":"10.1103/PhysRevFluids.1.043601"},"rights":{"rightsStatement":"©2016 American Physical Society","copyrightYear":2016,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"S. Prinz","firstname":"S.","surname":"Prinz","affiliationIds":["a1"]},{"type":"Person","name":"V. Bandaru","firstname":"V.","surname":"Bandaru","affiliationIds":["a1"]},{"type":"Person","name":"Y. Kolesnikov","firstname":"Y.","surname":"Kolesnikov","affiliationIds":["a1"]},{"type":"Person","name":"D. Krasnov","firstname":"D.","surname":"Krasnov","affiliationIds":["a1"]},{"type":"Person","name":"T. Boeck","firstname":"T.","surname":"Boeck","affiliationIds":["a1"]}],"affiliations":[{"id":"a1","name":"Institut für Thermo- und Fluiddynamik, Technische Universität Ilmenau, Germany"}],"abstract":{"value":"<p>We present results from numerical reconstructions of magnetic obstacle experiments performed in liquid metal flows. The experimental setup consists of an open rectangular container filled with a thin layer of liquid metal (GaInSn). A permanent magnet is installed on a rail beneath the container and is moved with a constant velocity <span class=\"aps-inline-formula\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><msub><mi>U</mi><mn>0</mn></msub></math></span>, which in turn induces a flow inside the liquid metal due to Lorentz forces. The setup allows experiments in a parameter range that is accessible by direct numerical simulations (DNS). We present results from realizations with four different parameter sets, covering flows with stable stationary vortex structures in the reference system of the moving magnet as well as time-dependent flow regimes. Although the liquid metal layer is very thin, the flow shows a highly three-dimensional character in the near and in the far wake of the magnetic obstacle. We conclude that the streamline visualization in the experiment (using gas bubbles at the surface of the liquid metal layer) is insufficient to picture the flow structure occurring in the liquid metal. To underpin our conclusions, we introduce a modified numerical model which aims to mimic the movement of these gas bubbles. Although this model is a strong simplification of the highly complicated behavior of bubbles at a fluid-fluid interface, it captures the main effects and provides a good reproduction of the experimental results. Furthermore, transient effects are investigated when the flow is initiated, i.e., when the magnet approaches the container and crosses its front wall. We conclude that the process of vortex formation is accompanied by a decrease of the streamwise component of the Lorentz force compared to the time when the fluid is still quiescent. This decrease occurs only for flows with stable vortex structures, which might be of interest for practical applications like Lorentz force velocimetry. The Lorentz forces obtained from our DNS are in good agreement with the values measured in experiment.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"512fd433-7b6d-4535-bb60-78f3bf431bc3","label":"Fluid Dynamics"}],"concepts":[{"id":"d2fd5563-5077-41b4-9d06-f0da03883073","label":"Flow instability","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}},{"id":"c25108e7-4697-4565-b484-221b808d454e","label":"Magnetohydrodynamics","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true}]}}}