{"id":"10.1103/PhysRevFluids.1.060507","title":{"value":"Efficient coordination of swarms of sensor-laden balloons for persistent, <i>in situ</i>, real-time measurement of hurricane development","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"PRFLUIDS","abbreviatedName":"Phys. Rev. Fluids","name":"Physical Review Fluids"},"issue":{"number":"6"},"volume":{"number":"1"},"pageStart":"060507","hasArticleId":true,"date":"2016-10-18","numPages":14,"articleType":"article","identifiers":{"doi":"10.1103/PhysRevFluids.1.060507"},"rights":{"rightsStatement":"©2016 American Physical Society","copyrightYear":2016,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"Thomas Bewley","firstname":"Thomas","surname":"Bewley","affiliationIds":["a1"]},{"type":"Person","name":"Gianluca Meneghello","firstname":"Gianluca","surname":"Meneghello","affiliationIds":["a1"]}],"affiliations":[{"id":"a1","name":"Flow Control Laboratory, Department of Mechanical and Aerospace Engineering, University of California, San Diego, La Jolla, California 92093-0411, USA"}],"abstract":{"value":"<p>Accurate long-term forecasts of the path and intensity of severe hurricanes are imperative to protect property and save lives. Extensive real-time measurements within hurricanes, especially near their core, are essential for supplementing the limited relevant information accessible by satellites in order to improve such forecasts. Current operational methods for obtaining <i>in situ</i> information, such as dropsondes and repeated manned and unmanned aircraft flights over and within hurricanes, are both expensive and limited in duration. In the present work it is demonstrated by numerical experiments how a swarm of robust, inexpensive, buoyancy-controlled, sensor-laden balloons might be deployed and controlled in an energetically efficient, coordinated fashion, for days at a time, to continuously monitor relevant properties (pressure, humidity, temperature, and wind speed) of a hurricane as it develops. Rather than fighting its gale-force winds, the strong and predictable stratification of these winds is leveraged to efficiently disperse the balloons into a favorable time-evolving distribution. An iterative bootstrap approach is envisioned in which (a) sensor balloons are used to help improve the available computational estimate of the uncertain and underresolved flow field of the hurricane and (b) this (imprecise) estimate of the hurricane flow field is leveraged to improve the distribution of the sensor balloons, which then better facilitates (a), etc. The control approach envisioned in this ambitious effort is a combination of (centrally computed) model predictive control for coordination at the largest scales, which is the focus of the present paper, coupled with a feedback control strategy (decentrally computed, on the balloons themselves), for smaller-scale corrections. Our work indicates that, following such an approach, certain target orbits of interest within the hurricane can be continuously sampled by some balloons, while others make repeated sweeps between the eye and the spiral rain bands.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"512fd433-7b6d-4535-bb60-78f3bf431bc3","label":"Fluid Dynamics"}],"concepts":[{"id":"133ff954-fb67-4d15-ae83-a684a1463dd6","label":"Stratified geophysical flows","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true},{"id":"ad1edc29-450c-4872-86ea-0034e0815b2e","label":"Atmospheric fluid dynamics","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}}]}}}