{"id":"10.1103/PhysRevFluids.1.054404","title":{"value":"Linear instabilities and recurring bursts of turbulence in rotating channel flow simulations","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"PRFLUIDS","abbreviatedName":"Phys. Rev. Fluids","name":"Physical Review Fluids"},"issue":{"number":"5"},"volume":{"number":"1"},"pageStart":"054404","hasArticleId":true,"date":"2016-09-19","numPages":21,"articleType":"article","identifiers":{"doi":"10.1103/PhysRevFluids.1.054404"},"rights":{"rightsStatement":"©2016 American Physical Society","copyrightYear":2016,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"Geert Brethouwer","firstname":"Geert","surname":"Brethouwer","affiliationIds":["a1"]}],"affiliations":[{"id":"a1","name":"Linné FLOW Centre and Swedish e-Science Research Centre, KTH Mechanics, SE-100 44 Stockholm, Sweden"}],"abstract":{"value":"<p>Intense recurring bursts of turbulence on a long time scale are observed in direct numerical simulations (DNSs) of channel flow subject to rapid spanwise rotation for a range of Reynolds numbers and rotation speeds. A necessary condition for manifestation of cyclic turbulent bursts is that the Reynolds number and rotation speed are sufficiently high. The principal cause of turbulent bursts is a linearly unstable Tollmien-Schlichting-like wave with a wave vector normal to the rotation axis. This exponentially growing wave breaks down through a secondary instability when its amplitude is large causing a burst of turbulence. A new instability develops once turbulence has subsided leading to a continuous and self-sustained cycle of bursts. In several DNSs a recurring instability happens despite the flow being strongly and continuously turbulent in a part of the channel while in other DNSs turbulence is mostly weak between bursts. DNS observations have been compared to linear stability theory using the spatially averaged velocity of the DNS as base flow. Analysis shows that Tollmien-Schlichting waves are linearly unstable if Reynolds number and rotation speed are sufficiently high and bursts are observed. In several cases a good agreement between predicted and observed growth rate and eigenfunction of the instability is found, but in other cases the growth rate is overpredicted by linear stability theory and in some cases a Tollmien-Schlichting instability is predicted but not observed. Further study indicates that when observations and predictions differ turbulence or other modes alter the unstable wave, thereby reducing its ability to extract energy from the mean flow. In none of the analyzed DNSs was a significant nonlinear energy transfer from the unstable mode to other modes noted. Inclusion of an eddy viscosity in linear stability theory did not notably improve correspondence with DNSs.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"512fd433-7b6d-4535-bb60-78f3bf431bc3","label":"Fluid Dynamics"}],"concepts":[{"id":"0c2f74cc-42b0-4b3a-b470-cd50aa7d0f89","label":"Boundary layers","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true},{"id":"d2fd5563-5077-41b4-9d06-f0da03883073","label":"Flow instability","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}},{"id":"062f0300c33d4782b24c43996b0469f3","label":"Turbulence","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}}]}}}