{"id":"10.1103/PhysRevFluids.1.064404","title":{"value":"Eulerian formulation of the interacting particle representation model of homogeneous turbulence","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"PRFLUIDS","abbreviatedName":"Phys. Rev. Fluids","name":"Physical Review Fluids"},"issue":{"number":"6"},"volume":{"number":"1"},"pageStart":"064404","hasArticleId":true,"date":"2016-10-21","numPages":33,"articleType":"article","identifiers":{"doi":"10.1103/PhysRevFluids.1.064404"},"rights":{"rightsStatement":"©2016 American Physical Society","copyrightYear":2016,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"Alejandro Campos","firstname":"Alejandro","surname":"Campos","affiliationIds":["a1"]},{"type":"Person","name":"Karthik Duraisamy","firstname":"Karthik","surname":"Duraisamy","affiliationIds":["a2"]},{"type":"Person","name":"Gianluca Iaccarino","firstname":"Gianluca","surname":"Iaccarino","affiliationIds":["a3"]}],"affiliations":[{"id":"a1","name":"Lawrence Livermore National Laboratory, Livermore, California 94550, USA"},{"id":"a2","name":"Department of Aerospace Engineering, University of Michigan, Ann Arbor, Michigan 48109, USA"},{"id":"a3","name":"Department of Mechanical Engineering, Stanford University, Stanford, California 94305, USA"}],"abstract":{"value":"<p>The Interacting Particle Representation Model (IPRM) of homogeneous turbulence incorporates information about the morphology of turbulent structures within the confines of a one-point model. In the original formulation [Kassinos and Reynolds, Center for Turbulence Research: Annual Research Briefs, 31–51 (1996)], the IPRM was developed in a Lagrangian setting by evolving second moments of velocity conditional on a given gradient vector. In the present work, the IPRM is reformulated in an Eulerian framework, and evolution equations are developed for the marginal probability density functions (PDFs). Eulerian methods avoid the issues associated with statistical estimators used by Lagrangian approaches, such as slow convergence. A specific emphasis of this work is to use the IPRM to examine the long time evolution of homogeneous turbulence. We first describe the derivation of the marginal PDF in spherical coordinates, which reduces the number of independent variables and the cost associated with Eulerian simulations of PDF models. Next, a numerical method based on radial basis functions over a spherical domain is adapted to the IPRM. Finally, results obtained with the new Eulerian solution method are thoroughly analyzed. The sensitivity of the Eulerian simulations to parameters of the numerical scheme, such as the size of the time step and the shape parameter of the radial basis functions, is examined. A comparison between Eulerian and Lagrangian simulations is performed to discern the capabilities of each of the methods. Finally, a linear stability analysis based on the eigenvalues of the discrete differential operators is carried out for both the new Eulerian solution method and the original Lagrangian approach.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"512fd433-7b6d-4535-bb60-78f3bf431bc3","label":"Fluid Dynamics"}],"concepts":[{"id":"062f0300c33d4782b24c43996b0469f3","label":"Turbulence","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true}]}}}