{"id":"10.1103/PhysRevFluids.1.043901","title":{"value":"Fragmentation mechanisms of confined co-flowing capillary threads revealed by active flow focusing","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"PRFLUIDS","abbreviatedName":"Phys. Rev. Fluids","name":"Physical Review Fluids"},"issue":{"number":"4"},"volume":{"number":"1"},"pageStart":"043901","hasArticleId":true,"date":"2016-08-10","numPages":22,"articleType":"article","identifiers":{"doi":"10.1103/PhysRevFluids.1.043901"},"rights":{"rightsStatement":"©2016 American Physical Society","copyrightYear":2016,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"Matthieu Robert de Saint Vincent","firstname":"Matthieu","surname":"Robert de Saint Vincent","affiliationIds":["a1","a2","a3"]},{"type":"Person","name":"Jean-Pierre Delville","firstname":"Jean-Pierre","surname":"Delville","affiliationIds":["a2","a3"]}],"affiliations":[{"id":"a1","name":"IPR, UMR CNRS 6251, Campus Beaulieu, Université Rennes 1, 35042 Rennes, France"},{"id":"a2","name":"Université Bordeaux, LOMA, UMR 5798, F-33400 Talence, France"},{"id":"a3","name":"CNRS, LOMA, UMR 5798, F-33400 Talence, France"}],"abstract":{"value":"<p>The control over stationary liquid thread fragmentation in confined co-flows is a key issue for the processing and transport of fluids in (micro-)ducts. Confinement indeed strongly enhances the stability of capillary threads, and also induces steric and hydrodynamic feedback effects on diphasic flows. We investigate the thread-to-droplet transition within the confined environment of a microchannel by using optocapillarity, i.e., interface stresses driven by light, as a wall-free constriction to locally flow focus stable threads in a tunable way, pinch them, and force their fragmentation. Above some flow-dependent onset in optical forcing, we observe a dynamic transition alternating between continuous (thread) and fragmented (droplets) states and show a surprisingly gradual thread-to-droplet transition when increasing the amplitude of the thread constriction. This transition is interpreted as an evolution from a convective to an absolute instability. Depending on the forcing amplitude, we then identify and characterize several stable fragmented regimes of single and multiple droplet periodicity (up to period-8). These droplet regimes build a robust flow-independent bifurcation diagram that eventually closes up, due to the flow confinement, to a monodisperse droplet size, independent of the forcing and close to the most unstable mode expected from the Rayleigh-Plateau instability. This fixed monodispersity can be circumvented by temporally modulating the optocapillary coupling, as we show that fragmentation can then occur either by triggering again the Rayleigh-Plateau instability when the largest excitable wavelength is larger than that of the most unstable mode, or as a pure consequence of a sufficiently strong optocapillary pinching. When properly adjusted, this modulation allows us to avoid the transient reforming and multidisperse regimes, and thereby to reversibly produce stable monodisperse droplet trains of controlled size. By actuating local flow focusing in time and amplitude, optocapillarity thus proves to be an efficient way to characterize and understand the thread-to-droplet transition in microchannels and to advance channel constriction strategies for the production of tunable monodisperse droplets when the overall confinement is important.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"e4211828-5d99-4bc4-b986-eb2bbbc8b248","label":"Interdisciplinary Physics"},{"id":"512fd433-7b6d-4535-bb60-78f3bf431bc3","label":"Fluid Dynamics"}],"concepts":[{"id":"42faf1b1-780c-431c-9a74-5d330820f7f7","label":"Waves","facet":{"id":"f45b3c40-959c-4e90-ba0e-38232980802a","label":"Physical Systems"}},{"id":"8f585b75-23e9-4388-afe5-364824c412da","label":"Surface tension effects","facet":{"id":"f45b3c40-959c-4e90-ba0e-38232980802a","label":"Physical Systems"}},{"id":"b72a2d57-f47e-4e87-9a43-f8320d817bae","label":"Drop phenomena","facet":{"id":"f45b3c40-959c-4e90-ba0e-38232980802a","label":"Physical Systems"}},{"id":"edff6507-ef6e-4655-88ac-33fa3e31b6fb","label":"Microscale flows","facet":{"id":"f45b3c40-959c-4e90-ba0e-38232980802a","label":"Physical Systems"}},{"id":"36c186b3-6f92-4d27-a215-e59d74aa95b6","label":"Interfacial phenomena","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}},{"id":"5c98e96f-9b4d-4af7-9105-c87cd60b2ab5","label":"Flows in microchannels","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true},{"id":"f5372742-fa5e-4bda-96ba-87e45d98bae6","label":"Interfacial flows","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}}]}}}