{"id":"10.1103/PhysRevFluids.1.084102","title":{"value":"Instantaneous insulation in a micro-slab: A mechanism for flow generation in a rarefied gas","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"PRFLUIDS","abbreviatedName":"Phys. Rev. Fluids","name":"Physical Review Fluids"},"issue":{"number":"8"},"volume":{"number":"1"},"pageStart":"084102","hasArticleId":true,"date":"2016-12-19","numPages":20,"articleType":"article","identifiers":{"doi":"10.1103/PhysRevFluids.1.084102"},"rights":{"rightsStatement":"©2016 American Physical Society","copyrightYear":2016,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"A. Manela","firstname":"A.","surname":"Manela","affiliationIds":["a1"]},{"type":"Person","name":"L. Pogorelyuk","firstname":"L.","surname":"Pogorelyuk","affiliationIds":["a2"]}],"affiliations":[{"id":"a1","name":"Faculty of Aerospace Engineering, Technion–Israel Institute of Technology, Haifa 32000, Israel"},{"id":"a2","name":"Department of Mechanical and Aerospace Engineering, Princeton University, Princeton, New Jersey 08544, USA"}],"abstract":{"value":"<p>We analyze the response of a gas in a micro-slab, set at an initial pure-conduction state, to instantaneous thermal insulation of its boundaries. In line with ongoing efforts in generating gas flows at the microscale, thermal insulation is suggested as a means for flow excitation with no moving parts. The problem is analyzed in the entire range of gas rarefaction rates and for arbitrary initial temperature differences between the walls. Analytical solutions are obtained in the linearized limit of small temperature differences for large (collisionless) and small (continuum) Knudsen numbers. These solutions are supported by direct simulation Monte Carlo calculations, which are then used to investigate the nonlinear problem with large initial temperature differences. Followed by the system's initial state, boundary insulation results in a series of time-decaying waves, propagating across the slab, and transferring the system between its conductive and adiabatic equilibrium states. While larger initial temperature differences result in higher flow rates, it is found that nonlinear effects reduce the efficiency of flow excitation through boundaries insulation. At high Knudsen numbers, this is rationalized through the system's initial state, in which the gas uniform temperature is lower than the arithmetic mean of walls temperatures. At low Knudsen numbers, the dominant effect of molecular collisions causes thermal dissipation, which in turn results in kinetic energy losses. The analysis may be readily applied to calculate the gas response to arbitrary time variations of the boundary-imposed heat flux.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"512fd433-7b6d-4535-bb60-78f3bf431bc3","label":"Fluid Dynamics"}],"concepts":[{"id":"6f991c28-112d-4bdf-9c2c-50cec44f48fe","label":"Rarefied flows","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true},{"id":"edff6507-ef6e-4655-88ac-33fa3e31b6fb","label":"Microscale flows","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}}]}}}