{"id":"10.1103/PhysRevFluids.1.073603","title":{"value":"Hub vortex instability within wind turbine wakes: Effects of wind turbulence, loading conditions, and blade aerodynamics","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"PRFLUIDS","abbreviatedName":"Phys. Rev. Fluids","name":"Physical Review Fluids"},"issue":{"number":"7"},"volume":{"number":"1"},"pageStart":"073603","hasArticleId":true,"date":"2016-11-08","numPages":18,"articleType":"article","identifiers":{"doi":"10.1103/PhysRevFluids.1.073603"},"rights":{"rightsStatement":"©2016 American Physical Society","copyrightYear":2016,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"Ryan Ashton","firstname":"Ryan","surname":"Ashton","affiliationIds":["a1"]},{"type":"Person","name":"Francesco Viola","firstname":"Francesco","surname":"Viola","affiliationIds":["a2"]},{"type":"Person","name":"Simone Camarri","firstname":"Simone","surname":"Camarri","affiliationIds":["a3"]},{"type":"Person","name":"Francois Gallaire","firstname":"Francois","surname":"Gallaire","affiliationIds":["a2"]},{"type":"Person","name":"Giacomo Valerio Iungo","firstname":"Giacomo Valerio","surname":"Iungo","affiliationIds":["a1"]}],"affiliations":[{"id":"a1","name":"University of Texas at Dallas, Mechanical Engineering Department, Wind Fluids and Experiments Lab (WindFluX), Richardson, Texas 75080, USA"},{"id":"a2","name":"Ecole Polytechnique Fédérale de Lausanne (EPFL), Laboratory of Fluid Mechanics and Instabilities (LFMI), Lausanne, Switzerland"},{"id":"a3","name":"Department of Civil and Industrial Engineering, University of Pisa, Pisa, Italy"}],"abstract":{"value":"<p>The near wake of wind turbines is characterized by the presence of the hub vortex, which is a coherent vorticity structure generated from the interaction between the root vortices and the boundary layer evolving over the turbine nacelle. By moving downstream, the hub vortex undergoes an instability with growth rate, azimuthal and axial wavenumbers determined by the characteristics of the incoming wind and turbine aerodynamics. Thus, a large variability of the hub vortex instability is expected for wind energy applications with consequent effects on wake downstream evolution, wake interactions within a wind farm, power production, and fatigue loads on turbines invested by wakes generated upstream. In order to predict characteristics of the hub vortex instability for different operating conditions, linear stability analysis is carried out by considering different statistics of the incoming wind turbulence, thrust coefficient, tip speed ratio, and blade lift distribution of a wind turbine. Axial and azimuthal wake velocity fields are modeled through Carton-McWilliams velocity profiles by mimicking the presence of the hub vortex, helicoidal tip vortices, and matching the wind turbine thrust coefficient predicted through the actuator disk model. The linear stability analysis shows that hub vortex instability is strongly affected by the wind turbine loading conditions, and specifically it is promoted by a larger thrust coefficient. A higher load of the wind turbines produces an enhanced axial velocity deficit and, in turn, higher shear in the radial direction of the streamwise velocity. The axial velocity shear within the turbine wake is also the main physical mechanism promoting the hub vortex instability when varying the lift distribution over the blade span for a specific loading condition. Cases with a larger velocity deficit in proximity of the wake center and less aerodynamic load towards the blade tip result to be more unstable. Moreover, wake swirl promotes hub vortex instability, and it can also affect the azimuthal wave number of the most unstable mode. Finally, higher Reynolds stresses and turbulent eddy viscosity decrease both growth rate and azimuthal wave number of the most unstable mode.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"512fd433-7b6d-4535-bb60-78f3bf431bc3","label":"Fluid Dynamics"}],"concepts":[{"id":"4c984e2a-a745-480a-8a33-f96574b3bf03","label":"Wakes & jets","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}},{"id":"9fa410c9-2586-4115-8dca-190b22421a01","label":"Vortex flows","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}},{"id":"d2fd5563-5077-41b4-9d06-f0da03883073","label":"Flow instability","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true}]}}}