{"id":"10.1103/PhysRevFluids.1.043501","title":{"value":"Closed-loop control of boundary layer streaks induced by free-stream turbulence","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"PRFLUIDS","abbreviatedName":"Phys. Rev. Fluids","name":"Physical Review Fluids"},"issue":{"number":"4"},"volume":{"number":"1"},"pageStart":"043501","hasArticleId":true,"date":"2016-08-26","numPages":34,"articleType":"article","identifiers":{"doi":"10.1103/PhysRevFluids.1.043501"},"rights":{"rightsStatement":"©2016 American Physical Society","copyrightYear":2016,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"George Papadakis","firstname":"George","surname":"Papadakis","affiliationIds":["a1"]},{"type":"Person","name":"Liang Lu","firstname":"Liang","surname":"Lu","affiliationIds":["a1"]},{"type":"Person","name":"Pierre Ricco","firstname":"Pierre","surname":"Ricco","affiliationIds":["a2"]}],"affiliations":[{"id":"a1","name":"Department of Aeronautics, Imperial College London, London SW7 2AZ, United Kingdom"},{"id":"a2","name":"Department of Mechanical Engineering, University of Sheffield, Sheffield S1 3JD, United Kingdom"}],"abstract":{"value":"<p>The central aim of the paper is to carry out a theoretical and numerical study of active wall transpiration control of streaks generated within an incompressible boundary layer by free-stream turbulence. The disturbance flow model is based on the linearized unsteady boundary-region (LUBR) equations, studied by Leib, Wundrow, and Goldstein [<a href=\"http://dx.doi.org/10.1017/S0022112098003504\"><span>J. Fluid Mech.</span> <b>380</b>, 169 (1999)</a>], which are the rigorous asymptotic limit of the Navier-Stokes equations for low-frequency and long-streamwise wavelength. The mathematical formulation of the problem directly incorporates the random forcing into the equations in a consistent way. Due to linearity, this forcing is factored out and appears as a multiplicative factor. It is shown that the cost function (integral of kinetic energy in the domain) is properly defined as the expectation of a random quadratic function only after integration in wave number space. This operation naturally introduces the free-stream turbulence spectral tensor into the cost function. The controller gains for each wave number are independent of the spectral tensor and, in that sense, universal. Asymptotic matching of the LUBR equations with the free-stream conditions results in an additional forcing term in the state-space system whose presence necessitates the reformulation of the control problem and the rederivation of its solution. It is proved that the solution can be obtained analytically using an extension of the sweep method used in control theory to obtain the standard Riccati equation. The control signal consists of two components, a feedback part and a feed-forward part (that depends explicitly on the forcing term). Explicit recursive equations that provide these two components are derived. It is shown that the feed-forward part makes a negligible contribution to the control signal. We also derive an explicit expression that <i>a priori</i> (i.e., before solving the control problem) leads to the minimum of the objective cost function (i.e., the fundamental performance limit), based only on the system matrices and the initial and free-stream boundary conditions. The adjoint equations admit a self-similar solution for large spanwise wave numbers with a scaling which is different from that of the LUBR equations. The controlled flow field also has a self-similar solution if the weighting matrices of the objective function are chosen appropriately. The code developed to implement this algorithm is efficient and has modest memory requirements. Computations show the significant reduction of energy for each wave number. The control of the full spectrum streaks, for conditions corresponding to a realistic experimental case, shows that the root-mean-square of the streamwise velocity is strongly suppressed in the whole domain and for all the frequency ranges examined.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"512fd433-7b6d-4535-bb60-78f3bf431bc3","label":"Fluid Dynamics"}],"concepts":[{"id":"9cf04270-c27c-4351-8840-9d94a7d19eea","label":"Instability control","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true},{"id":"6c97eab8-c8f6-4c2e-9228-deb3732737c0","label":"Boundary layer receptivity, stability & separation","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}}]}}}