{"id":"10.1103/PhysRevFluids.1.033602","title":{"value":"Consistent formulation of solid dissipative effects in stability analysis of flow past a deformable solid","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"PRFLUIDS","abbreviatedName":"Phys. Rev. Fluids","name":"Physical Review Fluids"},"issue":{"number":"3"},"volume":{"number":"1"},"pageStart":"033602","hasArticleId":true,"date":"2016-07-21","numPages":13,"articleType":"article","identifiers":{"doi":"10.1103/PhysRevFluids.1.033602"},"rights":{"rightsStatement":"©2016 American Physical Society","copyrightYear":2016,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"D. Giribabu","firstname":"D.","surname":"Giribabu","affiliationIds":["a1"]},{"type":"Person","name":"V. Shankar","firstname":"V.","surname":"Shankar","affiliationIds":["a1"]}],"affiliations":[{"id":"a1","name":"Department of Chemical Engineering, Indian Institute of Technology, Kanpur 208016, India"}],"abstract":{"value":"<p>The linear stability of plane Couette flow past a deformable solid is analyzed in the creeping-flow limit with an objective towards elucidating the consequences of employing two widely different formulations for the dissipative stresses in the deformable solid. One of the formulations postulates that the dissipative stress is proportional to the strain-rate tensor based on the left Cauchy-Green tensor, while in the other the dissipative stress in the solid is proportional to the rate-of-deformation tensor. However, it is well known in continuum mechanics that the rate-of-deformation tensor obeys the fundamental principle of material-frame indifference while the strain-rate-tensor formulation does not and hence it is more appropriate to employ the rate-of-deformation tensor in the description of dissipative stresses in deformable solids. In this work we consider the specific context of stability of plane Couette flow past a deformable solid and demonstrate that the results concerning the stability of the system from both models differ drastically. In the rate-of-deformation formulation for the dissipative stress, there is a range of solid-fluid thickness ratios (between 1.21 and 1.46) wherein the system is always stable for nonzero values of solid viscosity, unlike the strain-rate-tensor formulation wherein the system is unstable at all values of solid thickness. Further, for a solid-fluid thickness ratio less than 1, incorporation of dissipative effects in the solid using the rate-of-deformation formulation shows that the flow is more unstable compared to a purely elastic neo-Hookean solid, while for strain-rate-tensor formulation the flow is stabilized with an increase in viscosity of the solid. Using the fundamentally correct dissipative stress formulation, we also address the stability of pressure-driven flow in a deformable channel, wherein previous work carried out for an elastic neo-Hookean solid has shown that only the short-wave instability (driven by the first normal stress difference in the solid) exists while the finite-wave instability is absent in the creeping-flow limit. Using a consistent formulation for viscous stresses in the solid, we show that the short-wave instability is completely stabilized beyond a critical viscosity of the solid. Thus the present study clearly demonstrates the importance of consistent modeling of dissipative effects in the solid in order to accurately predict the stability of fluid flow past deformable solid surfaces.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"2bd35371-7fda-477a-8e1a-c346c797a232","label":"Polymers & Soft Matter"},{"id":"512fd433-7b6d-4535-bb60-78f3bf431bc3","label":"Fluid Dynamics"}],"concepts":[{"id":"f5372742-fa5e-4bda-96ba-87e45d98bae6","label":"Interfacial flows","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}},{"id":"d2fd5563-5077-41b4-9d06-f0da03883073","label":"Flow instability","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true},{"id":"0f0cd98d57534e9a99e9068f5528eafe","label":"Flow boundary effects","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}}]}}}