{"id":"10.1103/PhysRevFluids.1.012501","title":{"value":"Pressure evolution in the shear layer of forming vortex rings","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"PRFLUIDS","abbreviatedName":"Phys. Rev. Fluids","name":"Physical Review Fluids"},"issue":{"number":"1"},"volume":{"number":"1"},"pageStart":"012501","hasArticleId":true,"date":"2016-05-02","numPages":8,"articleType":"rapid","identifiers":{"doi":"10.1103/PhysRevFluids.1.012501"},"rights":{"rightsStatement":"©2016 American Physical Society","copyrightYear":2016,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"Kristy Schlueter-Kuck","firstname":"Kristy","surname":"Schlueter-Kuck","affiliationIds":["a1"]},{"type":"Person","name":"John O. Dabiri","firstname":"John O.","surname":"Dabiri","affiliationIds":["a2"]}],"affiliations":[{"id":"a1","name":"Department of Mechanical Engineering, Stanford University, Stanford, California 94305, USA"},{"id":"a2","name":"Department of Civil and Environmental Engineering, and Department of Mechanical Engineering, Stanford University, Stanford, California 94305, USA"}],"abstract":{"value":"<p>This study investigated the relationship between the pinch-off of axisymmetric vortex rings and the evolution of pressure in the shear layer being entrained into the vortex rings. A piston-cylinder apparatus was used to generate the vortex rings, and five cases of constant piston acceleration over distances ranging from zero (impulsive start) to eight piston diameters were investigated. It was determined that increasing the distance over which the piston accelerated increased the dimensionless formation time at which the vortex ring pinches off, consistent with previous observations. A limiting value of vortex ring formation number of approximately seven is approached when the piston is accelerated over more than six piston diameters. For each case, the evolution of pressure in the shear layer was calculated based on PIV measurements of the velocity field and spatial integration of the corresponding pressure gradients using a recently developed algorithm. Plots of the shear layer pressure in X-T diagrams aided in identifying key features of the pressure associated with the evolution of vortex rings, including a high-pressure region that forms behind the leading ring. By extrapolating the motion of this high-pressure region back to the nozzle exit plane in the X-T diagram, its time of first appearance can be estimated. It is found that the appearance of the extrapolated local pressure maximum in the shear layer at the nozzle exit plane coincides with vortex ring pinch-off, as conventionally quantified by the vortex ring formation number.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"512fd433-7b6d-4535-bb60-78f3bf431bc3","label":"Fluid Dynamics"}],"concepts":[{"id":"9c5b281b-03e8-44e5-bd2e-5ba452b0bd1a","label":"Shear flows","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}},{"id":"9fa410c9-2586-4115-8dca-190b22421a01","label":"Vortex flows","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true}]}}}