{"id":"10.1103/PhysRevFluids.1.013701","title":{"value":"Internal wave transmission through a thermohaline staircase","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"PRFLUIDS","abbreviatedName":"Phys. Rev. Fluids","name":"Physical Review Fluids"},"issue":{"number":"1"},"volume":{"number":"1"},"pageStart":"013701","hasArticleId":true,"date":"2016-05-09","numPages":13,"articleType":"article","identifiers":{"doi":"10.1103/PhysRevFluids.1.013701"},"rights":{"rightsStatement":"©2016 American Physical Society","copyrightYear":2016,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"Bruce R. Sutherland","firstname":"Bruce R.","surname":"Sutherland","affiliationIds":["a1"]}],"affiliations":[{"id":"a1","name":"Department of Physics and Department of Earth & Atmospheric Sciences, University of Alberta, Edmonton, Alberta, Canada T6G 2E1"}],"abstract":{"value":"<p>With the aim to predict energy transport by internal waves incident upon observed density staircases in the ocean, the theory for internal wave tunneling through a single finite-size mixed region is extended to predict the transmission of internal waves through a piecewise-constant density profile with an arbitrary number of steps. An analytic solution is found if all steps have equal vertical extent. From this solution, bounds are established for the relative incident horizontal wave number and frequency of waves that have negligible transmission, a result that is independent of the number of steps. If the step sizes vary randomly about a mean vertical extent, the transmission can be computed numerically for several random realizations. Provided the horizontal wavelength is much longer than the total vertical extent of the staircase, the standard deviation of the computed transmission coefficients is small and the mean agrees well with the analytic prediction for equally spaced steps. The results are applied to thermohaline staircases observed in the ocean in order to put lower bounds on the wavelengths of long inertia gravity waves that significantly transmit to great depth.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"512fd433-7b6d-4535-bb60-78f3bf431bc3","label":"Fluid Dynamics"}],"concepts":[{"id":"133ff954-fb67-4d15-ae83-a684a1463dd6","label":"Stratified geophysical flows","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true},{"id":"787d6f81-9f93-4997-9978-cba2419977ca","label":"Oceanography","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}}]}}}