{"id":"10.1103/PhysRevFluids.1.064401","title":{"value":"Mesolayer of attached eddies in turbulent channel flow","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"PRFLUIDS","abbreviatedName":"Phys. Rev. Fluids","name":"Physical Review Fluids"},"issue":{"number":"6"},"volume":{"number":"1"},"pageStart":"064401","hasArticleId":true,"date":"2016-10-04","numPages":18,"articleType":"article","identifiers":{"doi":"10.1103/PhysRevFluids.1.064401"},"rights":{"rightsStatement":"©2016 American Physical Society","copyrightYear":2016,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"Yongyun Hwang","firstname":"Yongyun","surname":"Hwang","affiliationIds":["a1"]}],"affiliations":[{"id":"a1","name":"Department of Aeronautics, Imperial College London, South Kensington, London SW7 2AZ, United Kingdom"}],"abstract":{"value":"<p>Recent experimental measurements have reported that the outer peak of the streamwise wave-number spectra of the streamwise velocity depends on the Reynolds number. Starting from this puzzling observation, here it is proposed that the wall-parallel velocity components of each of the energy-containing motions in the form of Towsnend's attached eddies exhibit an inner-scaling nature in the region close to the wall. Some compelling evidence on this proposition has been presented with a careful inspection of scaling of velocity spectra from direct numerical simulations, a linear analysis with an eddy viscosity, and the recently computed statistical structure of the self-similar energy-containing motions in the logarithmic region. This observation suggests that the viscous wall effect would not be negligible at least below the peak wall-normal location of each of the energy-containing motions in the logarithmic and outer regions, reminiscent of the concept of the mesolayer previously observed in the mean momentum balance. It is shown that this behavior emerges due to a minimal form of scale interaction, modeled by the eddy viscosity in the linear theory, and enables one to explain the Reynolds-number-dependent behavior of the outer peak as well as the near-wall penetration of the large-scale outer structures in a consistent manner. Incorporation of this viscous wall effect to Townsend's attached eddies, which were originally built with an inviscid approximation at the wall, also reveals that the self-similarity of the wall-parallel velocity components of the energy-containing motions would be theoretically broken in the region close to the wall.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"512fd433-7b6d-4535-bb60-78f3bf431bc3","label":"Fluid Dynamics"}],"concepts":[{"id":"0a43aead-b705-4673-811a-b190990b9013","label":"Turbulence theory","facet":{"id":"b96dac97-ab85-4320-892d-9b245caf097f","label":"Theoretical Techniques"}},{"id":"0c2f74cc-42b0-4b3a-b470-cd50aa7d0f89","label":"Boundary layers","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true},{"id":"062f0300c33d4782b24c43996b0469f3","label":"Turbulence","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}}]}}}