{"id":"10.1103/PhysRevFluids.1.044105","title":{"value":"Opto-electro-fluidics and tip coax conical surface plasmons","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"PRFLUIDS","abbreviatedName":"Phys. Rev. Fluids","name":"Physical Review Fluids"},"issue":{"number":"4"},"volume":{"number":"1"},"pageStart":"044105","hasArticleId":true,"date":"2016-08-23","numPages":20,"articleType":"article","identifiers":{"doi":"10.1103/PhysRevFluids.1.044105"},"rights":{"rightsStatement":"©2016 American Physical Society","copyrightYear":2016,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"Touvia Miloh","firstname":"Touvia","surname":"Miloh","affiliationIds":["a1"]}],"affiliations":[{"id":"a1","name":"School of Mechanical Engineering, University of Tel-Aviv, Tel-Aviv 69978, Israel"}],"abstract":{"value":"<p>The concept of electromagnetic energy enhancement and nanofocusing phenomena near the tip of a metaconical conducting tip by means of a surface plasmon-polaritons mechanism is discussed theoretically. In particular, we consider conical metallic structures with small apex angles and derive the corresponding dispersion relation under optimal (maximal field enhancement) operating conditions. It is demonstrated analytically that the aforementioned conditions can induce large dielectrophoretic forces near the conical tip, which can be harnessed for sorting and controlling nanoparticles in a manner similar to optical tweezers. Similarly, by considering Joule heating effects in the metal and heat conduction in the surrounding solute, it is shown that a considerable (dc) flow convection and mixing can be generated in the aqueous phase near the tip by such ac incited optical means (including common low-input lasers operating in the visible and near-infrared spectrum ranges). Analytic near-field expressions are also obtained for the opto-electro-thermo-induced flow and vorticity distributions in the electrolyte exhibiting a singular behavior near the rounded tip. Using a coax conical metastructure composed of two noble metals, surface-plasmon field enhancement is a technique for the optimal manipulation of dielectric and polarizable nanoparticles as well as for inducing indirect mixing in the liquid around the tip by generating microvortices.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"8ab3d2b7-b50b-460e-b086-8990cfcbd350","label":"Atomic, Molecular & Optical"},{"id":"512fd433-7b6d-4535-bb60-78f3bf431bc3","label":"Fluid Dynamics"},{"id":"e4211828-5d99-4bc4-b986-eb2bbbc8b248","label":"Interdisciplinary Physics"},{"id":"9f5c878e-b7b7-4030-bdb9-21a24ad97422","label":"Particles & Fields"}],"concepts":[{"id":"edff6507-ef6e-4655-88ac-33fa3e31b6fb","label":"Microscale flows","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}},{"id":"c7102703-2c55-4648-bf60-11f0f66a1256","label":"Nanoscale flows","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true}]}}}