{"id":"10.1103/PhysRevFluids.1.060501","title":{"value":"Mechanistic theory of margination and flow-induced segregation in confined multicomponent suspensions: Simple shear and Poiseuille flows","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"PRFLUIDS","abbreviatedName":"Phys. Rev. Fluids","name":"Physical Review Fluids"},"issue":{"number":"6"},"volume":{"number":"1"},"pageStart":"060501","hasArticleId":true,"date":"2016-10-18","numPages":30,"articleType":"article","identifiers":{"doi":"10.1103/PhysRevFluids.1.060501"},"rights":{"rightsStatement":"©2016 American Physical Society","copyrightYear":2016,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"Rafael G. Henríquez Rivera","firstname":"Rafael G.","surname":"Henríquez Rivera","affiliationIds":["a1"]},{"type":"Person","name":"Xiao Zhang","firstname":"Xiao","surname":"Zhang","affiliationIds":["a1"]},{"type":"Person","name":"Michael D. Graham","firstname":"Michael D.","surname":"Graham","affiliationIds":["a1"]}],"affiliations":[{"id":"a1","name":"Department of Chemical and Biological Engineering, University of Wisconsin-Madison, Madison, Wisconsin 53706-1691, USA"}],"abstract":{"value":"<p>A mechanistic model, derived from kinetic theory, is developed to describe segregation in confined multicomponent suspensions such as blood. It incorporates the two key phenomena arising in these systems at low Reynolds number: hydrodynamic pair collisions and hydrodynamic migration. Two flow profiles are considered: simple shear flow (plane Couette flow) and plane Poiseuille flow. The theory begins by writing the evolution of the number density of each component in the suspension as a master equation with contributions from migration and collisions. By making judicious approximations for the collisions, this system of integrodifferential equations is reduced to a set of drift-diffusion equations. We focus attention on the case of a binary suspension with a deformable primary component that completely dominates the collision dynamics in the system and a trace component that has no effect on the primary. The model captures the phenomena of depletion layer formation and margination observed in confined multicomponent suspensions of deformable particles. The depletion layer thickness of the primary component is predicted to follow a master curve relating it in a specific way to confinement ratio and volume fraction. Results from various sources (experiments, detailed simulations, master equation solutions) with different parameters (flexibility of different components in the suspension, viscosity ratio, confinement, among others) collapse onto the same curve. For sufficiently dilute suspensions the analytical form predicted by the drift-diffusion theory for this curve is in excellent agreement with results from these other sources with only one adjustable parameter. In a binary suspension, several regimes of segregation arise, depending on the value of a “margination parameter” <span class=\"aps-inline-formula\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><mi mathvariant=\"normal\">M</mi></math></span>. Most importantly, in both Couette and Poiseuille flows there is a critical value of <span class=\"aps-inline-formula\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><mi mathvariant=\"normal\">M</mi></math></span> below which a sharp “drainage transition” occurs: one component is completely depleted from the bulk flow to the vicinity of the walls. Direct simulations also exhibit this transition as the size or flexibility ratio of the components changes. Finally, some prior studies suggest a nonmonotonic dependence of margination propensity on volume fraction. We formulate a hypothesis regarding this observation. Theory predictions support the hypothesis, providing further insights into the mechanisms behind margination and segregation phenomena.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"0e9db8ef-5aa8-40bc-a0c8-9d93f5fcc2eb","label":"Biological Physics"},{"id":"2bd35371-7fda-477a-8e1a-c346c797a232","label":"Polymers & Soft Matter"},{"id":"512fd433-7b6d-4535-bb60-78f3bf431bc3","label":"Fluid Dynamics"}],"concepts":[{"id":"f10e180c-1ed7-4aee-9c62-1a863581317c","label":"Suspensions","facet":{"id":"f45b3c40-959c-4e90-ba0e-38232980802a","label":"Physical Systems"},"primary":true},{"id":"52399a41-c27b-49c2-96c3-120524795d0b","label":"Complex fluids","facet":{"id":"f45b3c40-959c-4e90-ba0e-38232980802a","label":"Physical Systems"}},{"id":"356040c7f8a24afaa9e4c6f22fd80281","label":"Blood","facet":{"id":"f45b3c40-959c-4e90-ba0e-38232980802a","label":"Physical Systems"}},{"id":"51fd4190-cd29-4fa9-afea-7274fbad0ce6","label":"Drug delivery","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}},{"id":"c2ea9e2c0e1549eeb336111976b0b965","label":"Cell processes & properties","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}},{"id":"21804fac-0546-45ed-98d5-b6af0f0d3228","label":"Biological fluid dynamics","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}}]}}}