{"id":"10.1103/PhysRevFluids.1.083801","title":{"value":"Linear models for sound from supersonic reacting mixing layers","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"PRFLUIDS","abbreviatedName":"Phys. Rev. Fluids","name":"Physical Review Fluids"},"issue":{"number":"8"},"volume":{"number":"1"},"pageStart":"083801","hasArticleId":true,"date":"2016-12-21","numPages":27,"articleType":"article","identifiers":{"doi":"10.1103/PhysRevFluids.1.083801"},"rights":{"rightsStatement":"©2016 American Physical Society","copyrightYear":2016,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"P. Shivakanth Chary","firstname":"P. Shivakanth","surname":"Chary","affiliationIds":["a1"]},{"type":"Person","name":"Arnab Samanta","firstname":"Arnab","surname":"Samanta","affiliationIds":["a1"]}],"affiliations":[{"id":"a1","name":"Department of Aerospace Engineering, Indian Institute of Science, Bangalore 560012, India"}],"abstract":{"value":"<p>We perform a linearized reduced-order modeling of the aeroacoustic sound sources in supersonic reacting mixing layers to explore their sensitivities to some of the flow parameters in radiating sound. Specifically, we investigate the role of outer modes as the effective flow compressibility is raised, when some of these are expected to dominate over the traditional Kelvin-Helmholtz (K-H) -type central mode. Although the outer modes are known to be of lesser importance in the near-field mixing, how these radiate to the far-field is uncertain, on which we focus. On keeping the flow compressibility fixed, the outer modes are realized via biasing the respective mean densities of the fast (oxidizer) or slow (fuel) side. Here the mean flows are laminar solutions of two-dimensional compressible boundary layers with an imposed composite (turbulent) spreading rate, which we show to significantly alter the growth of instability waves by saturating them earlier, similar to in nonlinear calculations, achieved here via solving the linear parabolized stability equations. As the flow parameters are varied, instability of the slow modes is shown to be more sensitive to heat release, potentially exceeding equivalent central modes, as these modes yield relatively compact sound sources with lesser spreading of the mixing layer, when compared to the corresponding fast modes. In contrast, the radiated sound seems to be relatively unaffected when the mixture equivalence ratio is varied, except for a lean mixture which is shown to yield a pronounced effect on the slow mode radiation by reducing its modal growth.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"512fd433-7b6d-4535-bb60-78f3bf431bc3","label":"Fluid Dynamics"}],"concepts":[{"id":"d2fd5563-5077-41b4-9d06-f0da03883073","label":"Flow instability","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}},{"id":"5ad87d23-7dd2-4d60-bc90-68055febea41","label":"Reacting flows","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}},{"id":"9c5b281b-03e8-44e5-bd2e-5ba452b0bd1a","label":"Shear flows","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}},{"id":"4da3f7ed-7c00-40e3-bb14-55c39886e2cc","label":"Aerodynamic noise","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true}]}}}