{"id":"10.1103/PhysRevFluids.1.083201","title":{"value":"Hemodynamic forces in a model left ventricle","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"PRFLUIDS","abbreviatedName":"Phys. Rev. Fluids","name":"Physical Review Fluids"},"issue":{"number":"8"},"volume":{"number":"1"},"pageStart":"083201","hasArticleId":true,"date":"2016-12-23","numPages":20,"articleType":"article","identifiers":{"doi":"10.1103/PhysRevFluids.1.083201"},"rights":{"rightsStatement":"©2016 American Physical Society","copyrightYear":2016,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"Federico Domenichini","firstname":"Federico","surname":"Domenichini","affiliationIds":["a1"]},{"type":"Person","name":"Gianni Pedrizzetti","firstname":"Gianni","surname":"Pedrizzetti","affiliationIds":["a2"]}],"affiliations":[{"id":"a1","name":"Department of Civil and Environmental Engineering, University of Firenze, Via S. Marta 3, 50139 Firenze, Italy"},{"id":"a2","name":"Department of Engineering and Architecture, University of Trieste, Piazzale Europa 1, 34127 Trieste, Italy"}],"abstract":{"value":"<p>Intraventricular pressure gradients were clinically demonstrated to represent one useful indicator of the left ventricle (LV) function during the development of heart failure. We analyze the fluid dynamics inside a model LV to improve the understanding of the development of hemodynamic forces (i.e., mean pressure gradient) in normal conditions and their modification in the presence of alterations of LV tissue motion. To this aim, the problem is solved numerically and the global force exchanged between blood flow and LV boundaries is computed by volume integration. We also introduce a simplified analytical model, based on global conservation laws, to estimate hemodynamic forces from the knowledge of LV tissue information commonly available in cardiac imaging. Numerical results show that the normal intraventricular gradients feature a deep brief suction at early diastolic filling and a persistent thrust during systolic ejection. In presence of abnormalities of the wall motion, the loss of time synchrony is more relevant than the loss of spatial uniformity in modifying the normal pressure gradient spatiotemporal pattern. The main findings are reproduced in the integral model, which represents a possible easy approach for integrating fluid dynamics evaluations in the clinical examination.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"0e9db8ef-5aa8-40bc-a0c8-9d93f5fcc2eb","label":"Biological Physics"}],"concepts":[{"id":"12f6f3a9-8096-40e2-9170-e8f3a45d6bd9","label":"Physiological flows","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}},{"id":"505b716e-8e82-444b-834c-e769c4d53e64","label":"Cardiac dynamics","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true}]}}}