{"id":"10.1103/PhysRevFluids.1.073202","title":{"value":"Role of body stiffness in undulatory swimming: Insights from robotic and computational models","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"PRFLUIDS","abbreviatedName":"Phys. Rev. Fluids","name":"Physical Review Fluids"},"issue":{"number":"7"},"volume":{"number":"1"},"pageStart":"073202","hasArticleId":true,"date":"2016-11-21","numPages":17,"articleType":"article","identifiers":{"doi":"10.1103/PhysRevFluids.1.073202"},"rights":{"rightsStatement":"©2016 American Physical Society","copyrightYear":2016,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"Eric D. Tytell","firstname":"Eric D.","surname":"Tytell","affiliationIds":["a1"]},{"type":"Person","name":"Megan C. Leftwich","firstname":"Megan C.","surname":"Leftwich","affiliationIds":["a2"]},{"type":"Person","name":"Chia-Yu Hsu","firstname":"Chia-Yu","surname":"Hsu","affiliationIds":["a3"]},{"type":"Person","name":"Boyce E. Griffith","firstname":"Boyce E.","surname":"Griffith","affiliationIds":["a4"]},{"type":"Person","name":"Avis H. Cohen","firstname":"Avis H.","surname":"Cohen","affiliationIds":["a5"]},{"type":"Person","name":"Alexander J. Smits","firstname":"Alexander J.","surname":"Smits","affiliationIds":["a6"]},{"type":"Person","name":"Christina Hamlet","firstname":"Christina","surname":"Hamlet","affiliationIds":["a7"]},{"type":"Person","name":"Lisa J. Fauci","firstname":"Lisa J.","surname":"Fauci","affiliationIds":["a7"]}],"affiliations":[{"id":"a1","name":"Department of Biology, Tufts University, Medford, Massachusetts 02155, USA"},{"id":"a2","name":"Department of Mechanical and Aerospace Engineering, George Washington University, Washington, DC 20052, USA"},{"id":"a3","name":"Department of Applied Mathematics, Feng Chia University, Taiwan"},{"id":"a4","name":"Department of Mathematics and Department of Biomedical Engineering, University of North Carolina, Chapel Hill, North Carolina 27599, USA"},{"id":"a5","name":"Institute for Systems Research and Department of Biology, University of Maryland, College Park, Maryland 20742, USA"},{"id":"a6","name":"Department of Mechanical and Aerospace Engineering, Princeton University, Princeton, New Jersey 08544, USA"},{"id":"a7","name":"Department of Mathematics and Center for Computational Science, Tulane University, New Orleans, Louisiana 70118, USA"}],"abstract":{"value":"<p>In an effort to understand the locomotion dynamics of a simple vertebrate, the lamprey, both physical and computational models have been developed. A key feature of these models is the ability to vary the passive stiffness of portions of the swimmer, focusing on highly flexible models similar in material properties to lampreys and other anguilliform fishes. The physical model is a robotic lampreylike swimmer that is actuated along most of its length but has passively flexible tails of different stiffnesses. The computational model is a two-dimensional model that captures fluid-structure interactions using an immersed boundary framework. This simulated lamprey is passively flexible throughout its length and is also actuated along most of its length by the activation of muscle forces. Although the three-dimensional robot and the two-dimensional computational swimmer are such different constructs, we demonstrate that the wake structures generated by these models share many features and we examine how flexibility affects these features. Both models produce wakes with two or more same-sign vortices shed each time the tail changes direction (a “2P” or higher-order wake). In general, wakes become less coherent as tail flexibility increases. We examine the pressure distribution near the tail tip and the timing of vortex formation in both cases and find good agreement. Because we include flexibility, we are able to estimate resonant frequencies for several of the robotic and computational swimmers. We find that actuation at the resonant frequency dramatically increases the distance traveled per tail-beat cycle with only a small increase in the lost kinetic energy in the wake, suggesting that the resonant swimmers are more efficient.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"0e9db8ef-5aa8-40bc-a0c8-9d93f5fcc2eb","label":"Biological Physics"},{"id":"512fd433-7b6d-4535-bb60-78f3bf431bc3","label":"Fluid Dynamics"}],"concepts":[{"id":"d56b5277-e328-4221-a086-720804ca6adf","label":"Biological movement","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}},{"id":"52c158bb-fb1e-4d1b-a117-b6b279c3bc67","label":"Interactions in fluids","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}},{"id":"9fa410c9-2586-4115-8dca-190b22421a01","label":"Vortex flows","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}},{"id":"963f61af-35ba-4d8a-9a68-7133715e5e2b","label":"Swimming","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true}]}}}