{"id":"10.1103/PhysRevFluids.1.053603","title":{"value":"High-frequency instabilities of stationary crossflow vortices in a hypersonic boundary layer","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"PRFLUIDS","abbreviatedName":"Phys. Rev. Fluids","name":"Physical Review Fluids"},"issue":{"number":"5"},"volume":{"number":"1"},"pageStart":"053603","hasArticleId":true,"date":"2016-09-26","numPages":32,"articleType":"article","identifiers":{"doi":"10.1103/PhysRevFluids.1.053603"},"rights":{"rightsStatement":"©2016 American Physical Society","copyrightYear":2016,"copyrightHolders":[{"name":"American Physical Society"},{"name":"us"}]},"authors":[{"type":"Person","name":"Fei Li","firstname":"Fei","surname":"Li","affiliationIds":["a1"]},{"type":"Person","name":"Meelan Choudhari","firstname":"Meelan","surname":"Choudhari","affiliationIds":["a1"]},{"type":"Person","name":"Pedro Paredes","firstname":"Pedro","surname":"Paredes","affiliationIds":["a1"]},{"type":"Person","name":"Lian Duan","firstname":"Lian","surname":"Duan","affiliationIds":["a2"]}],"affiliations":[{"id":"a1","name":"NASA Langley Research Center, Hampton, Virginia 23681, USA"},{"id":"a2","name":"Department of Mechanical and Aerospace Engineering, Missouri University of Science and Technology, Rolla, Missouri 65409, USA"}],"abstract":{"value":"<p>Hypersonic boundary layer flows over a circular cone at moderate incidence angle can support strong crossflow instability in between the windward and leeward rays on the plane of symmetry. Due to more efficient excitation of stationary crossflow vortices by surface roughness, such boundary layer flows may transition to turbulence via rapid amplification of the high-frequency secondary instabilities of finite-amplitude stationary crossflow vortices. The amplification characteristics of these secondary instabilities are investigated for crossflow vortices generated by an azimuthally periodic array of roughness elements over a 7° half-angle circular cone in a Mach 6 free stream. The analysis is based on both quasiparallel stability theory in the form of a partial-differential-equation-based eigenvalue analysis and plane marching parabolized stability equations that account for the effects of the nonparallel basic state on the growth of secondary disturbances. Depending on the local amplitude of the stationary crossflow mode, the most unstable high-frequency disturbances either originate from the second (i.e., Mack) mode instabilities of the unperturbed boundary layer or correspond to genuine secondary instabilities that reduce to stable disturbances at sufficiently small amplitudes of the stationary crossflow vortex. The predicted frequencies of the dominant secondary disturbances of either type are similar to those measured during wind tunnel experiments at Purdue University and the Technical University of Braunschweig, Germany. Including transverse surface curvature within the quasiparallel predictions does not alter the topology of the unstable modes; however, the resulting changes in both mode shape and disturbance growth rate are rather significant and curvature can be either stabilizing or destabilizing depending on the disturbance frequency and mode type. Nonparallel effects are shown to be strongly destabilizing for secondary instabilities originating from both Mack modes and instabilities of the inclined shear layer bounding the crossflow vortex. Consequently, the two types of instabilities are found to achieve logarithmic amplification factors of up to <span class=\"aps-inline-formula\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><mrow><mi>N</mi><mo>=</mo><mn>10</mn></mrow></math></span> and <span class=\"aps-inline-formula\"><math xmlns=\"http://www.w3.org/1998/Math/MathML\"><mrow><mi>N</mi><mo>=</mo><mn>7</mn></mrow></math></span>, respectively. Results also reveal possible phase synchronization between a pair of modes that may have a significant influence on their overall amplification.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"512fd433-7b6d-4535-bb60-78f3bf431bc3","label":"Fluid Dynamics"}],"concepts":[{"id":"d2fd5563-5077-41b4-9d06-f0da03883073","label":"Flow instability","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}},{"id":"e6ada997-f540-4edc-acae-073c259e6e78","label":"Transition to turbulence","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true}]}}}