{"id":"10.1103/PhysRevFluids.1.073903","title":{"value":"Dynamics of a thin film flowing down a heated wall with finite thermal diffusivity","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"PRFLUIDS","abbreviatedName":"Phys. Rev. Fluids","name":"Physical Review Fluids"},"issue":{"number":"7"},"volume":{"number":"1"},"pageStart":"073903","hasArticleId":true,"date":"2016-11-28","numPages":26,"articleType":"article","identifiers":{"doi":"10.1103/PhysRevFluids.1.073903"},"rights":{"rightsStatement":"©2016 American Physical Society","copyrightYear":2016,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"Michael C. Dallaston","firstname":"Michael C.","surname":"Dallaston","affiliationIds":["a1"]},{"type":"Person","name":"Dmitri Tseluiko","firstname":"Dmitri","surname":"Tseluiko","affiliationIds":["a2"]},{"type":"Person","name":"Serafim Kalliadasis","firstname":"Serafim","surname":"Kalliadasis","affiliationIds":["a3"]}],"affiliations":[{"id":"a1","name":"Department of Chemical Engineering, Imperial College London, London SW7 2AZ, United Kingdom"},{"id":"a2","name":"Department of Mathematical Sciences, Loughborough University, Loughborough LE11 3TU, United Kingdom"},{"id":"a3","name":"Department of Chemical Engineering, Imperial College London, London SW7 2AZ, United Kingdom"}],"abstract":{"value":"<p>Consider the dynamics of a thin film flowing down a heated substrate. The substrate heating generates a temperature distribution on the free surface, which in turn induces surface-tension gradients and corresponding thermocapillary stresses that affect the free surface and therefore the fluid flow. We study here the effect of finite substrate thermal diffusivity on the film dynamics. Linear stability analysis of the full Navier-Stokes and heat transport equations indicates if the substrate diffusivity is sufficiently small, the film becomes unstable at a finite wavelength and at a Reynolds number smaller than that predicted in the long-wavelength limit. This property is captured in a reduced-order system of equations derived using a weighted-residual integral-boundary-layer method. This reduced-order model is also used to compute the bifurcation diagrams of solution branches connecting the trivial flat film to traveling waves including solitary pulses. The effect of finite diffusivity is to separate a simultaneous Hopf-transcritical bifurcation into its individual component bifurcations. The appropriate Hopf bifurcation then connects only to the solution branch of negative-hump pulses, with wave speed less than the linear wave speed, while the branch of positive-single-hump pulses merges with the branch of positive-two-hump pulses at a supercritical Reynolds number. In the regime where finite-wavelength instability occurs, there exists a Hopf-bifurcation pair connected by a branch of periodic solutions, whose period cannot be increased indefinitely. Numerical simulation of the reduced-order system shows the development of a train of coherent structures, each of which resembles a stationary positive-hump pulse, and, in the regime of finite-wavelength instability, wavelength selection and saturation to periodic traveling waves.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"512fd433-7b6d-4535-bb60-78f3bf431bc3","label":"Fluid Dynamics"},{"id":"6f025065-4b96-4156-b146-2c285d0994c4","label":"Nonlinear Dynamics"}],"concepts":[{"id":"8e35265c-459a-43fc-9eb8-73e1dd82b47c","label":"Pattern formation","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}},{"id":"50adc7d0-14e7-4a61-82ce-46d54feb45a9","label":"Instability of free-surface flows","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true},{"id":"d2fd5563-5077-41b4-9d06-f0da03883073","label":"Flow instability","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}},{"id":"af1f8b12-9181-4c18-a750-d9e9fe621217","label":"Bifurcations","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"}}]}}}