{"id":"10.1103/PhysRevFluids.1.053604","title":{"value":"Paths and wakes of deformable nearly spheroidal rising bubbles close to the transition to path instability","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"PRFLUIDS","abbreviatedName":"Phys. Rev. Fluids","name":"Physical Review Fluids"},"issue":{"number":"5"},"volume":{"number":"1"},"pageStart":"053604","hasArticleId":true,"date":"2016-09-27","numPages":30,"articleType":"article","identifiers":{"doi":"10.1103/PhysRevFluids.1.053604"},"rights":{"rightsStatement":"©2016 American Physical Society","copyrightYear":2016,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"José Carlos Cano-Lozano","firstname":"José Carlos","surname":"Cano-Lozano","affiliationIds":["a1"]},{"type":"Person","name":"Carlos Martínez-Bazán","firstname":"Carlos","surname":"Martínez-Bazán","affiliationIds":["a1"]},{"type":"Person","name":"Jacques Magnaudet","firstname":"Jacques","surname":"Magnaudet","affiliationIds":["a2"]},{"type":"Person","name":"Joël Tchoufag","firstname":"Joël","surname":"Tchoufag","affiliationIds":["a3"]}],"affiliations":[{"id":"a1","name":"Área de Mecánica de Fluidos, Departamento de Ingeniería Mecánica y Minera, Universidad de Jaén, Campus de las Lagunillas, 23071 Jaén, Spain"},{"id":"a2","name":"Institut de Mécanique des Fluides de Toulouse, Université de Toulouse, CNRS, INPT, UPS, 31062 Toulouse, France"},{"id":"a3","name":"Institut de Mécanique des Fluides de Toulouse, Université de Toulouse, CNRS, INPT, UPS, 31062 Toulouse, France and Department of Mechanical Engineering, University of California, Berkeley, Berkeley, California 94720, USA"}],"abstract":{"value":"<p>We report on a series of results provided by three-dimensional numerical simulations of nearly spheroidal bubbles freely rising and deforming in a still liquid in the regime close to the transition to path instability. These results improve upon those of recent computational studies [Cano-Lozano  <i>et al.</i>, <a href=\"http://dx.doi.org/10.1016/j.ijmultiphaseflow.2012.11.005\"><span>Int. J. Multiphase Flow</span> <b>51</b>, 11 (2013)</a>; <a href=\"http://dx.doi.org/10.1063/1.4939703\"><span>Phys. Fluids</span> <b>28</b>, 014102 (2016)</a>] in which the neutral curve associated with this transition was obtained by considering realistic but frozen bubble shapes. Depending on the dimensionless parameters that characterize the system, various paths geometries are observed by letting an initially spherical bubble starting from rest rise under the effect of buoyancy and adjust its shape to the surrounding flow. These include the well-documented rectilinear axisymmetric, planar zigzagging, and spiraling (or helical) regimes. A flattened spiraling regime that most often eventually turns into either a planar zigzagging or a helical regime is also frequently observed. Finally, a chaotic regime in which the bubble experiences small horizontal displacements (typically one order of magnitude smaller than in the other regimes) is found to take place in a region of the parameter space where no standing eddy exists at the back of the bubble. The discovery of this regime provides evidence that path instability does not always result from a wake instability as previously believed. In each regime, we examine the characteristics of the path, bubble shape, and vortical structure in the wake, as well as their couplings. In particular, we observe that, depending on the fluctuations of the rise velocity, two different vortex shedding modes exist in the zigzagging regime, confirming earlier findings with falling spheres. The simulations also reveal that significant bubble deformations may take place along zigzagging or spiraling paths and that, under certain circumstances, they dramatically alter the wake structure. The instability thresholds that can be inferred from the computations compare favorably with experimental data provided by various sets of recent experiments guaranteeing that the bubble surface is free of surfactants.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"512fd433-7b6d-4535-bb60-78f3bf431bc3","label":"Fluid Dynamics"}],"concepts":[{"id":"a3ff37a7-c0a4-48a9-a32f-0dbc060c2746","label":"Navier-Stokes equation","facet":{"id":"b96dac97-ab85-4320-892d-9b245caf097f","label":"Theoretical Techniques"}},{"id":"98cac094-ec9c-4f37-adf7-eed968f89359","label":"Bubbles","facet":{"id":"f45b3c40-959c-4e90-ba0e-38232980802a","label":"Physical Systems"},"primary":true}]}}}