{"id":"10.1103/PhysRevFluids.1.043603","title":{"value":"Mechanical picture of the linear transient growth of vortical perturbations in incompressible smooth shear flows","format":"html+mathml"},"publisher":{"name":"APS"},"journal":{"id":"PRFLUIDS","abbreviatedName":"Phys. Rev. Fluids","name":"Physical Review Fluids"},"issue":{"number":"4"},"volume":{"number":"1"},"pageStart":"043603","hasArticleId":true,"date":"2016-08-04","numPages":15,"articleType":"article","identifiers":{"doi":"10.1103/PhysRevFluids.1.043603"},"rights":{"rightsStatement":"©2016 American Physical Society","copyrightYear":2016,"copyrightHolders":[{"name":"American Physical Society"}]},"authors":[{"type":"Person","name":"George Chagelishvili","firstname":"George","surname":"Chagelishvili","affiliationIds":["a1","a2"]},{"type":"Person","name":"Jan-Niklas Hau","firstname":"Jan-Niklas","surname":"Hau","affiliationIds":["a3","a4"]},{"type":"Person","name":"George Khujadze","firstname":"George","surname":"Khujadze","affiliationIds":["a5"]},{"type":"Person","name":"Martin Oberlack","firstname":"Martin","surname":"Oberlack","affiliationIds":["a3","a4"]}],"affiliations":[{"id":"a1","name":"Abastumani Astrophysical Observatory, Ilia State University, Tbilisi 0160, Georgia"},{"id":"a2","name":"M. Nodia Institute of Geophysics, Tbilisi State University, Tbilisi 0128, Georgia"},{"id":"a3","name":"Chair of Fluid Dynamics, Department of Mechanical Engineering, Technische Universität Darmstadt, Otto-Berndt-Strasse 2, 64287, Darmstadt, Germany"},{"id":"a4","name":"GSC CE, Technische Universität Darmstadt, Dolivostraße 15, 64293 Darmstadt, Germany"},{"id":"a5","name":"Chair of Fluid Mechanics, Universität Siegen, Paul-Bonatz-Str. 9-11, 57068 Siegen, Germany"}],"abstract":{"value":"<p>The linear dynamics of perturbations in smooth shear flows covers the transient exchange of energies between (1) the perturbations and the basic flow and (2) different perturbations modes. Canonically, the linear exchange of energies between the perturbations and the basic flow can be described in terms of the Orr and the lift-up mechanisms, correspondingly for two-dimensional (2D) and three-dimensional (3D) perturbations. In this paper the mechanical basis of the linear transient dynamics is introduced and analyzed for incompressible plane constant shear flows, where we consider the dynamics of virtual fluid particles in the framework of plane perturbations (i.e., perturbations with plane surfaces of constant phase) for the 2D and 3D case. It is shown that (1) the formation of a pressure perturbation field is the result of countermoving neighboring sets of incompressible fluid particles in the flow, (2) the keystone of the energy exchange mechanism between the basic flow and perturbations is the collision of fluid particles with the planes of constant pressure in accordance with the classical theory of elastic collision of particles with a rigid wall, making the pressure field the key player in this process, (3) the interplay of the collision process and the shear flow kinematics describes the transient growth of plane perturbations and captures the physics of the growth, and (4) the proposed mechanical picture allows us to reconstruct the linearized Euler equations in spectral space with a time-dependent shearwise wave number, the linearized Euler equations for Kelvin modes. This confirms the rigor of the presented analysis, which, moreover, yields a natural generalization of the proposed mechanical picture of the transient growth to the well-established linear phenomenon of vortex–wave-mode coupling.</p>","format":"html+mathml"},"classificationSchemes":{"physh":{"disciplines":[{"id":"512fd433-7b6d-4535-bb60-78f3bf431bc3","label":"Fluid Dynamics"}],"concepts":[{"id":"a3ff37a7-c0a4-48a9-a32f-0dbc060c2746","label":"Navier-Stokes equation","facet":{"id":"b96dac97-ab85-4320-892d-9b245caf097f","label":"Theoretical Techniques"}},{"id":"d2fd5563-5077-41b4-9d06-f0da03883073","label":"Flow instability","facet":{"id":"bdb1ef91-b776-4e36-8f8f-3e93666bac1e","label":"Research Areas"},"primary":true}]}}}